{
  "backend/main.mo": "Main backend actor defining all data types (GiftPack, Cart, Order, UserProfile, Coupon, etc.), state maps for storage, and includes mixins for blob storage and authorization.",
  "feature_evidence.json": "Feature evidence report documenting two high-confidence features related to debugging gift pack tile rendering issues on the catalog page, both referencing useGiftPacks.ts hook.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend components and pages, describing routing, cart functionality, checkout flow, admin features, and UI component behaviors.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes, defining colors for UI elements like backgrounds, borders, and component states.",
  "frontend/index.html": "HTML entry point that loads the React app and includes Razorpay checkout script for payment integration.",
  "frontend/src/App.tsx": "Root application component configuring TanStack Router with all routes, AdminAuthProvider, ThemeProvider, automatic data initialization, and login/logout handlers that sync or clear cart state.",
  "frontend/src/components/admin/CategoryForm.tsx": "Reusable form component for creating or editing categories with name and description fields, validation, loading states, and cancel functionality.",
  "frontend/src/components/admin/CategoryList.tsx": "Displays a list of categories with loading skeletons, empty state handling, and optional edit buttons for each category card.",
  "frontend/src/components/admin/CategoryManagement.tsx": "Manages category creation and editing with a form and list view, using custom hooks for data fetching and mutations with toast notifications for success/error feedback.",
  "frontend/src/components/admin/CouponForm.tsx": "React Hook Form-based coupon form supporting create/edit modes with fields for code, discount percentage, min/max discount constraints, expiration date, and quantity validation.",
  "frontend/src/components/admin/CouponList.tsx": "Displays a grid of coupon cards showing code, discount details, quantity remaining, expiration date, and status badges (Active/Expired/Sold Out) with optional edit functionality.",
  "frontend/src/components/admin/CouponManagement.tsx": "Orchestrates coupon CRUD operations by combining CouponForm and CouponList components, handling create/update mutations and managing edit state with toast notifications.",
  "frontend/src/components/admin/GiftPackForm.tsx": "Comprehensive gift pack form using React Hook Form with field arrays for multiple images, dropdowns for category/basket type/size, and support for create/edit modes with price and discount fields.",
  "frontend/src/components/admin/GiftPackList.tsx": "Displays gift packs in a responsive grid with image previews, badges for category/type/size, discount indicators, and action buttons for edit/delete with confirmation dialog.",
  "frontend/src/components/admin/GiftPackManagement.tsx": "Coordinates gift pack CRUD operations by combining GiftPackForm and GiftPackList, managing edit state and delegating mutations to custom hooks.",
  "frontend/src/components/admin/OrderDetailModal.tsx": "Modal component that displays detailed order information including status, payment, items, delivery address, and gift message. Allows admins to update order status via a dropdown select.",
  "frontend/src/components/admin/OrderFilters.tsx": "Filter component for orders with search by order ID/customer name, status dropdown, and date range picker. Manages filter state and notifies parent component of changes.",
  "frontend/src/components/admin/OrderList.tsx": "Displays a list of orders as clickable cards showing order ID, date, customer, items, total, and status badges. Opens OrderDetailModal when an order is clicked.",
  "frontend/src/components/admin/OrderManagement.tsx": "Main order management component that combines OrderFilters and OrderList, applying client-side filtering by search term, status, and date range to the orders fetched from the backend.",
  "frontend/src/components/admin/PaymentDetailModal.tsx": "Modal displaying detailed payment information including transaction ID, amount, status, payer details, and associated order information. Fetches and displays the linked order if available.",
  "frontend/src/components/admin/PaymentFilters.tsx": "Filter component for payments with search by transaction ID, payment status dropdown, and date range picker. Manages filter state and propagates changes to parent component.",
  "frontend/src/components/admin/PaymentList.tsx": "Displays a grid of payment cards with transaction details (ID, amount, status, payer) and opens a detail modal on click. Shows loading skeletons or empty state when appropriate.",
  "frontend/src/components/admin/PaymentManagement.tsx": "Main payment management component that fetches payments, applies filters (search, status, date range), and renders the filtered payment list. Handles loading and error states.",
  "frontend/src/components/admin/ProductForm.tsx": "React Hook Form-based product creation/editing form with fields for ID, name, description, price, category, and multiple image URLs. Supports both create and update modes with validation.",
  "frontend/src/components/admin/ProductList.tsx": "Displays a grid of product cards with images, details, and edit/delete actions. Shows loading skeletons, error alerts, or empty state when no products exist.",
  "frontend/src/components/admin/ProductManagement.tsx": "Orchestrates product CRUD operations with create/update/delete mutations, manages form visibility and editing state, and displays toast notifications for operation results.",
  "frontend/src/components/auth/ProtectedAdminRoute.tsx": "Authentication guard component that redirects unauthenticated users to login and shows a loading spinner during auth check. Renders children only when authenticated.",
  "frontend/src/components/cart/CartItemRow.tsx": "Renders a single cart item with image, title, pricing (with discount calculation), quantity controls, and remove button. Displays optional custom message and wrapping options.",
  "frontend/src/components/cart/CartSummary.tsx": "Displays cart summary with subtotal, GST, and total price, including a checkout button that navigates to the checkout page when clicked.",
  "frontend/src/components/checkout/AddressForm.tsx": "Form component for entering and validating delivery address with pincode serviceability checking, phone validation, and pre-population from user profile.",
  "frontend/src/components/checkout/OrderSummary.tsx": "Shows order summary at checkout with item list, subtotal, coupon discount (if applied), GST, and total price.",
  "frontend/src/components/customization/BasketTypeSelector.tsx": "Allows users to select a basket type (wicker basket, wooden crate, or gift box) with visual cards showing icons and descriptions.",
  "frontend/src/components/customization/ItemSelector.tsx": "Grid of selectable gift items with a maximum item limit, showing mock items with prices and categories that can be toggled on/off.",
  "frontend/src/components/customization/MessageCardForm.tsx": "Textarea form for adding an optional personalized message (max 200 characters) to include with the gift.",
  "frontend/src/components/customization/PackingTypeSelector.tsx": "Allows selection of gift packing style (classic/premium wrap or gold/silver ribbon) with color-coded visual cards.",
  "frontend/src/components/customization/PackPreview.tsx": "Sticky sidebar preview showing selected basket type, size, items, packing style, message, and calculated total price with item removal capability.",
  "frontend/src/components/customization/PersonalizationForm.tsx": "Empty file with no content.",
  "frontend/src/components/customization/SizeSelector.tsx": "Displays a grid of selectable gift basket size cards (Small, Medium, Large) with capacity, description, and pricing information. Highlights the selected size with a terracotta ring border.",
  "frontend/src/components/customization/StepIndicator.tsx": "Renders a horizontal progress indicator showing 5 customization steps (Basket Type, Size, Products, Packing, Message). Displays completed steps with checkmarks, current step highlighted, and connecting lines between steps.",
  "frontend/src/components/customization/StepNavigation.tsx": "Provides Back and Next navigation buttons for multi-step customization flow. Disables Back on first step and Next when canProceed is false.",
  "frontend/src/components/delivery/PincodeChecker.tsx": "Card component that validates and checks if a 6-digit pincode is serviceable for delivery using the backend actor. Shows loading state and success/error feedback with appropriate icons and messages.",
  "frontend/src/components/layout/Footer.tsx": "Footer component with four columns containing brand info, quick links, delivery information, and social media icons. Includes copyright notice and caffeine.ai attribution.",
  "frontend/src/components/layout/Header.tsx": "Sticky header with logo, navigation menu, pincode checker popover, cart icon with item count, and authentication controls. Includes mobile menu sheet and shows admin link for authenticated admin users.",
  "frontend/src/components/layout/Layout.tsx": "Root layout component that wraps pages with Header, main content area using Outlet, and Footer in a flex column structure.",
  "frontend/src/components/product/FilterSidebar.tsx": "Filterable sidebar for catalog browsing with category checkboxes and price range slider. Renders as a card on desktop and a sheet drawer on mobile, with clear all filters functionality.",
  "frontend/src/components/product/GiftPackCard.tsx": "Displays a gift pack card with image carousel, discount badge, pricing, and add-to-cart functionality. Navigates to gift pack detail page on click.",
  "frontend/src/components/product/ProductGrid.tsx": "Renders a grid of GiftPackCard components with add-to-cart handling and toast notifications. Shows empty state when no gift packs are available.",
  "frontend/src/components/profile/OrderHistoryCard.tsx": "Displays individual order details with expandable item list, status badges, payment status, and formatted date. Shows order total and item count.",
  "frontend/src/components/profile/OrderHistorySection.tsx": "Fetches and displays user order history sorted by date with loading and error states. Shows empty state when no orders exist.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor instance with authentication, initializes access control, and invalidates dependent queries on actor changes.",
  "frontend/src/hooks/useAdminAuth.tsx": "Provides admin authentication context with hardcoded credentials, session persistence in localStorage, and login/logout functionality.",
  "frontend/src/hooks/useCart.ts": "Manages shopping cart state with localStorage persistence, backend synchronization when authenticated, and operations for adding, updating, and removing items.",
  "frontend/src/hooks/useCategories.ts": "Fetches all categories from the backend using React Query with actor dependency.",
  "frontend/src/hooks/useCategoryMutation.ts": "Provides mutations for creating and updating categories with query cache invalidation on success.",
  "frontend/src/hooks/useContactForm.ts": "Provides mutation hook for submitting contact form data to the backend actor.",
  "frontend/src/hooks/useCoupon.ts": "Validates coupon codes via backend actor and calculates discount amounts based on coupon percentage.",
  "frontend/src/hooks/useCouponMutation.ts": "Provides React Query mutations for creating and updating coupons, plus a query hook for fetching all coupons (currently returns empty array as backend method is not implemented).",
  "frontend/src/hooks/useCustomProducts.ts": "Exports a React Query hook to fetch all custom products from the backend actor.",
  "frontend/src/hooks/useGiftPackMutation.ts": "Provides React Query mutations for creating, updating, and deleting gift packs with toast notifications and query cache invalidation.",
  "frontend/src/hooks/useGiftPacks.ts": "Exports React Query hooks for fetching all gift packs, filtered gift packs (with search and category filters), and individual gift packs by ID.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for Internet Identity authentication, managing login state, identity persistence, and delegation validation.",
  "frontend/src/hooks/useOrder.ts": "Exports a React Query mutation hook for creating orders with cart items, delivery details, and payment information.",
  "frontend/src/hooks/useOrderHistory.ts": "Provides a React Query hook to fetch the authenticated user's order history from the backend.",
  "frontend/src/hooks/useOrderManagement.ts": "Exports admin hooks for fetching all orders (sorted by creation date) and updating order status with toast notifications.",
  "frontend/src/hooks/usePaymentManagement.ts": "Provides a React Query hook to fetch and sort all Razorpay payments by payment ID in descending order.",
  "frontend/src/hooks/useProductMutation.ts": "Exports React Query mutations for creating, updating, and deleting custom products (delete not yet implemented in backend).",
  "frontend/src/hooks/useQueries.ts": "Provides a mutation hook to initialize backend data and invalidate gift pack queries on success.",
  "frontend/src/hooks/useRazorpay.ts": "Custom hook for initiating Razorpay payment flows with order details, handling success/failure callbacks and payment processing state.",
  "frontend/src/hooks/useUserProfile.ts": "Exports hooks for fetching the authenticated user's profile and updating profile information including name, email, phone, and delivery address.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom design tokens defining a warm color palette (terracotta, sage green, cream) for both light and dark modes, plus utility classes for the custom colors.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient for data fetching and InternetIdentityProvider for authentication, then renders the main App component.",
  "frontend/src/pages/AdminLoginPage.tsx": "Admin login page with form validation using react-hook-form, handles authentication via useAdminAuth hook and redirects to admin dashboard on success.",
  "frontend/src/pages/AdminPage.tsx": "Admin dashboard page displaying management sections for orders, payments, products, categories, coupons, and gift packs with logout functionality.",
  "frontend/src/pages/CartPage.tsx": "Shopping cart page showing cart items with quantity controls, custom messages, and wrapping options, plus a cart summary sidebar and empty state with navigation to catalog/custom pages.",
  "frontend/src/pages/CatalogPage.tsx": "Gift pack catalog page with search bar, filter sidebar, and product grid displaying filtered results with loading skeletons.",
  "frontend/src/pages/CheckoutPage.tsx": "Checkout page handling authentication check, address form, coupon validation and application, order creation, and Razorpay payment integration with order summary display.",
  "frontend/src/pages/ContactPage.tsx": "Contact form page with validation for name, email, phone, and message fields. Uses react-hook-form and displays success/error alerts after submission.",
  "frontend/src/pages/CustomPackPage.tsx": "Multi-step custom gift pack builder with 5 steps: basket type selection, size selection, product selection, packing type, and optional message card. Validates each step and adds completed pack to cart.",
  "frontend/src/pages/GiftPackDetailPage.tsx": "Gift pack detail page displaying product images in a gallery, pricing with discounts, description, and add-to-cart functionality. Shows loading skeletons and error states.",
  "frontend/src/pages/HomePage.tsx": "Landing page with hero section, feature highlights (curated collections, customization, delivery), and featured gift packs grid. Includes navigation to catalog and custom pack builder.",
  "frontend/src/pages/OrderConfirmationPage.tsx": "Order confirmation page displaying order ID, estimated delivery date, and payment status. Retrieves payment ID from sessionStorage and provides navigation back to home or order tracking.",
  "frontend/src/pages/ProfilePage.tsx": "User profile page component with form for editing personal details and delivery address, includes pincode serviceability checking and order history display. Requires authentication and validates Indian states, phone numbers, and pincodes.",
  "frontend/src/types/razorpay.d.ts": "TypeScript type definitions for Razorpay payment gateway integration, defining options, response objects, and the global Razorpay instance interface.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting and managing URL parameters from both regular query strings and hash-based routing, with sessionStorage persistence support for maintaining state across navigation.",
  "frontend/src/utils/validation.ts": "Validation utility functions for Indian pincodes (6 digits) and phone numbers (10 digits), with placeholder for delivery availability checking via backend actor.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom color palette (terracotta, sage, cream), extended theme settings for typography, animations, and design system tokens using OKLCH color space.",
  "project_state.json": "Project state tracking file indicating an active bug fix request for gift pack tiles not loading on the browse/catalog page, with features related to debugging data fetching and rendering logic."
}