{
  "backend/main.mo": "Main backend actor defining all data types (GiftPack, Cart, Order, UserProfile, Coupon, etc.) and in-memory Map storage for gift packs, orders, payments, user carts, coupons, and contact submissions with included MixinStorage and MixinAuthorization modules.",
  "feature_evidence.json": "Feature evidence report documenting three implemented features: clickable GiftPackCard navigation, GiftPackDetailPage creation, and route registration for '/gift-pack/:id' pattern, all with high confidence.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend components and pages including routing, cart management with bigint quantities, checkout with Razorpay integration, admin authentication, and responsive layouts.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes defining colors for background, foreground, primary, secondary, muted, accent, destructive, borders, and sidebar components.",
  "frontend/index.html": "HTML entry point with Razorpay checkout script inclusion and root div for React mounting.",
  "frontend/src/App.tsx": "Main app component with TanStack Router configuration for all routes (home, catalog, gift pack detail, custom, cart, checkout, order confirmation, profile, contact, admin), AdminAuthProvider wrapper, automatic data initialization, and login/logout handlers that sync or clear cart.",
  "frontend/src/components/admin/CategoryForm.tsx": "React Hook Form-based category creation/editing form with name and description fields, validation, loading states, and cancel functionality for edit mode.",
  "frontend/src/components/admin/CategoryList.tsx": "Category list display component with loading skeletons, empty state handling, and optional edit button for each category card.",
  "frontend/src/components/admin/CategoryManagement.tsx": "Manages category creation and editing with a form and list view, using custom hooks for data fetching and mutations, and displays toast notifications for success/error states.",
  "frontend/src/components/admin/CouponForm.tsx": "React Hook Form-based coupon creation/editing form with fields for code, discount percentage, min/max discount constraints, expiration date, and quantity, with validation and auto-uppercase code formatting.",
  "frontend/src/components/admin/CouponList.tsx": "Displays a grid of coupon cards showing code, discount details, quantity remaining, expiration date, and status badges (Active/Expired/Sold Out) with optional edit functionality.",
  "frontend/src/components/admin/CouponManagement.tsx": "Orchestrates coupon CRUD operations by combining CouponForm and CouponList components, handling create/update mutations and managing edit state with toast notifications.",
  "frontend/src/components/admin/GiftPackForm.tsx": "Comprehensive gift pack form with fields for ID, title, description, price, discount, category, basket type, size, and multiple image URLs using react-hook-form with field arrays.",
  "frontend/src/components/admin/GiftPackList.tsx": "Displays gift packs in a responsive grid with image previews, badges for category/type/size, pricing info, and action buttons for edit/delete with confirmation dialog.",
  "frontend/src/components/admin/GiftPackManagement.tsx": "Coordinates gift pack CRUD operations by combining GiftPackForm and GiftPackList, managing edit state and delegating mutations to custom hooks.",
  "frontend/src/components/admin/OrderDetailModal.tsx": "Modal dialog component that displays detailed information about a specific order, including status, payment info, items, delivery address, and special instructions. Allows admins to update order status via a dropdown select.",
  "frontend/src/components/admin/OrderFilters.tsx": "Filter component for orders with search by order ID/customer name, status dropdown, and date range picker. Manages filter state and notifies parent component of changes with clear filters functionality.",
  "frontend/src/components/admin/OrderList.tsx": "Displays a list of orders as clickable cards showing order ID, date, customer name, item count, total amount, and status badges. Opens OrderDetailModal when an order is clicked.",
  "frontend/src/components/admin/OrderManagement.tsx": "Main order management component that combines OrderFilters and OrderList, fetching all orders and applying client-side filtering by search term, status, and date range.",
  "frontend/src/components/admin/PaymentDetailModal.tsx": "Modal dialog displaying detailed payment information including transaction ID, amount, status, payment method, payer details, and associated order information if available.",
  "frontend/src/components/admin/PaymentFilters.tsx": "Filter component for payments with search by transaction ID, payment status dropdown (success/pending/failed), and date range picker. Manages filter state and notifies parent of changes.",
  "frontend/src/components/admin/PaymentList.tsx": "Displays a grid of payment cards with transaction details (ID, amount, payer, status) and opens a detail modal on click. Shows loading skeletons or empty state when appropriate.",
  "frontend/src/components/admin/PaymentManagement.tsx": "Main payment management component that fetches payments, applies filters (search, status, date range), and renders the filtered payment list. Handles loading and error states.",
  "frontend/src/components/admin/ProductForm.tsx": "React Hook Form-based product form for creating/editing products with fields for ID, name, description, price, category, and multiple image URLs. Supports dynamic image field array management.",
  "frontend/src/components/admin/ProductList.tsx": "Displays a grid of product cards with images, details, and edit/delete actions. Shows loading skeletons, error alerts, or empty state when no products exist.",
  "frontend/src/components/admin/ProductManagement.tsx": "Orchestrates product CRUD operations with create/update/delete mutations, manages form visibility and editing state, and displays success/error toasts. Renders ProductForm and ProductList components.",
  "frontend/src/components/auth/ProtectedAdminRoute.tsx": "Authentication guard component that redirects unauthenticated users to login page and shows a loading spinner during auth check. Renders children only when authenticated.",
  "frontend/src/components/cart/CartItemRow.tsx": "Renders a single cart item with product image, title, pricing (with discount), quantity controls, custom message/wrapping display, and remove button. Calculates and displays item total.",
  "frontend/src/components/cart/CartSummary.tsx": "Displays cart summary with subtotal, GST, and total price, including a button to proceed to checkout. Shows loading skeleton while gift packs data is being fetched.",
  "frontend/src/components/checkout/AddressForm.tsx": "Form component for entering delivery address with real-time pincode validation and serviceability checking. Pre-fills fields from user profile and validates phone and pincode before submission.",
  "frontend/src/components/checkout/OrderSummary.tsx": "Displays order summary at checkout showing items, subtotal, coupon discount (if applied), GST, and total price. Shows loading skeleton while gift packs data is being fetched.",
  "frontend/src/components/customization/BasketTypeSelector.tsx": "Allows users to select a basket type (wicker basket, wooden crate, or gift box) with visual cards showing icons and descriptions for each option.",
  "frontend/src/components/customization/ItemSelector.tsx": "Grid of selectable gift items with a maximum selection limit, showing mock items with prices and categories. Displays alert for selection count and disables items when limit is reached.",
  "frontend/src/components/customization/MessageCardForm.tsx": "Text area form for adding an optional personalized message to the gift with a 200-character limit and remaining character counter.",
  "frontend/src/components/customization/PackingTypeSelector.tsx": "Allows users to select a packing style (classic wrap, premium wrap, gold ribbon, or silver ribbon) with visual cards showing color-coded icons for each option.",
  "frontend/src/components/customization/PackPreview.tsx": "Sticky sidebar preview showing the custom pack configuration including basket type, size, selected items with prices, packing style, message card, and total price calculation.",
  "frontend/src/components/customization/PersonalizationForm.tsx": "File appears to be empty or truncated in the provided content.",
  "frontend/src/components/customization/SizeSelector.tsx": "Displays a grid of selectable gift basket size cards (Small, Medium, Large) with capacity, description, and price information. Highlights the selected size with a terracotta ring border.",
  "frontend/src/components/customization/StepIndicator.tsx": "Renders a horizontal progress indicator for a 5-step customization flow (Basket Type, Size, Products, Packing, Message). Shows completed steps with checkmarks, current step highlighted, and connecting lines between steps.",
  "frontend/src/components/customization/StepNavigation.tsx": "Provides Back and Next navigation buttons for multi-step forms. Disables Back on first step and Next when canProceed is false.",
  "frontend/src/components/delivery/PincodeChecker.tsx": "Card component that validates and checks pincode serviceability via backend actor. Displays success/error messages with icons and handles 6-digit pincode input validation.",
  "frontend/src/components/layout/Footer.tsx": "Site footer with four columns (About, Quick Links, Delivery Info, Social) and copyright notice. Includes navigation links, social media icons, and caffeine.ai attribution.",
  "frontend/src/components/layout/Header.tsx": "Sticky header with logo, navigation menu, pincode checker popover, cart badge, and authentication controls. Includes mobile menu sheet and conditional admin link for authenticated admin users.",
  "frontend/src/components/layout/Layout.tsx": "Root layout component that wraps pages with Header, main content area (Outlet), and Footer in a flex column structure.",
  "frontend/src/components/product/FilterSidebar.tsx": "Filterable sidebar for catalog with category checkboxes and price range slider. Renders as a card on desktop and a sheet drawer on mobile, with clear all functionality.",
  "frontend/src/components/product/GiftPackCard.tsx": "Displays a gift pack card with image carousel, discount badge, pricing, and add-to-cart functionality. Navigates to gift pack detail page on click.",
  "frontend/src/components/product/ProductGrid.tsx": "Renders a grid of GiftPackCard components with add-to-cart handling. Shows empty state when no gift packs are available.",
  "frontend/src/components/profile/OrderHistoryCard.tsx": "Displays individual order details including status, payment status, total amount, and expandable item list. Formats dates and shows order metadata.",
  "frontend/src/components/profile/OrderHistorySection.tsx": "Fetches and displays user order history sorted by date. Shows loading skeletons, error states, and empty state when no orders exist.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor instance with authentication via Internet Identity. Invalidates dependent queries when actor changes.",
  "frontend/src/hooks/useAdminAuth.tsx": "Provides admin authentication context with hardcoded credentials (admin/admin). Manages session state in localStorage.",
  "frontend/src/hooks/useCart.ts": "Manages shopping cart state with localStorage persistence and backend synchronization. Handles add, update, remove operations and calculates totals with coupon support.",
  "frontend/src/hooks/useCategories.ts": "React Query hook to fetch all categories from the backend actor. Enabled only when actor is available.",
  "frontend/src/hooks/useCategoryMutation.ts": "Provides mutations for creating and updating categories with automatic query invalidation. Update functionality is a placeholder pending backend implementation.",
  "frontend/src/hooks/useContactForm.ts": "Mutation hook for submitting contact form data to the backend actor.",
  "frontend/src/hooks/useCoupon.ts": "Provides coupon validation mutation and discount calculation utility. Validates coupon codes via backend and computes percentage-based discounts.",
  "frontend/src/hooks/useCouponMutation.ts": "Provides React Query mutations for creating and updating coupons, plus a query hook for fetching all coupons (currently returns empty array as backend method is not implemented).",
  "frontend/src/hooks/useCustomProducts.ts": "Exports a React Query hook to fetch all custom products from the backend actor.",
  "frontend/src/hooks/useGiftPackMutation.ts": "Provides React Query mutations for creating, updating, and deleting gift packs with toast notifications and query cache invalidation.",
  "frontend/src/hooks/useGiftPacks.ts": "Exports React Query hooks for fetching all gift packs, filtered gift packs by catalog filters, and individual gift packs by ID.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity authentication provider and hook for managing user login, logout, identity state, and login status with AuthClient integration.",
  "frontend/src/hooks/useOrder.ts": "Provides a React Query mutation hook for creating orders with cart items, delivery details, payment info, and optional coupon codes.",
  "frontend/src/hooks/useOrderHistory.ts": "Exports a React Query hook to fetch the authenticated user's order history from the backend actor.",
  "frontend/src/hooks/useOrderManagement.ts": "Provides admin hooks for fetching all orders (sorted by creation date) and updating order status with toast notifications.",
  "frontend/src/hooks/usePaymentManagement.ts": "Exports a React Query hook to fetch and sort all Razorpay payments by payment ID in descending order.",
  "frontend/src/hooks/useProductMutation.ts": "Provides React Query mutations for creating, updating, and deleting custom products (delete not yet implemented in backend).",
  "frontend/src/hooks/useQueries.ts": "Exports a mutation hook to initialize backend data and invalidate gift pack queries on success.",
  "frontend/src/hooks/useRazorpay.ts": "Provides a hook to initiate Razorpay payment flow with order details, handling success/failure callbacks and payment processing state.",
  "frontend/src/hooks/useUserProfile.ts": "Exports hooks for fetching the authenticated user's profile and updating profile information including name, email, phone, address, and pincode.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom color palette (terracotta, sage green, cream) for light and dark modes, including CSS custom properties for theming and typography utilities.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient for data fetching and InternetIdentityProvider for authentication.",
  "frontend/src/pages/AdminLoginPage.tsx": "Admin login page with form validation for username/password authentication, displaying error messages and redirecting to admin dashboard on success.",
  "frontend/src/pages/AdminPage.tsx": "Admin dashboard page containing management sections for orders, payments, products, categories, coupons, and gift packs with logout functionality.",
  "frontend/src/pages/CartPage.tsx": "Shopping cart page displaying cart items with quantity controls, custom messages, wrapping options, and cart summary with navigation to checkout or empty state.",
  "frontend/src/pages/CatalogPage.tsx": "Gift pack catalog page with search functionality, filter sidebar, and product grid displaying filtered results with loading skeletons.",
  "frontend/src/pages/CheckoutPage.tsx": "Checkout page handling authentication, address entry, coupon application, order creation, and Razorpay payment integration with validation and error handling.",
  "frontend/src/pages/ContactPage.tsx": "Contact form page with validation for name, email, phone, and message fields. Uses react-hook-form and displays success/error alerts after submission.",
  "frontend/src/pages/CustomPackPage.tsx": "Multi-step custom gift pack builder with 5 steps: basket type, size, product selection, packing type, and message card. Includes step navigation, validation, and cart integration.",
  "frontend/src/pages/GiftPackDetailPage.tsx": "Gift pack detail page displaying product images with carousel, pricing with discounts, and add-to-cart functionality. Includes loading states and error handling.",
  "frontend/src/pages/HomePage.tsx": "Landing page with hero section, feature highlights (curated collections, personalization, delivery), and featured gift packs display. Includes navigation to catalog and custom pack builder.",
  "frontend/src/pages/OrderConfirmationPage.tsx": "Order confirmation page displaying order ID, estimated delivery date, and payment status. Retrieves payment ID from sessionStorage and provides navigation back to home or orders.",
  "frontend/src/pages/ProfilePage.tsx": "User profile page component with form for editing personal details and delivery address, includes pincode serviceability checking, order history section, and Internet Identity authentication requirement.",
  "frontend/src/types/razorpay.d.ts": "TypeScript type definitions for Razorpay payment gateway integration, including options, response, and instance interfaces.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, storing, and managing URL parameters from both regular query strings and hash-based routing, with sessionStorage persistence support.",
  "frontend/src/utils/validation.ts": "Validation utility functions for pincode (6 digits) and phone number (10 digits) formats, with placeholder for delivery availability checking.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom color palette (terracotta, sage, cream), typography settings, animations, and design system tokens using OKLCH color space.",
  "project_state.json": "Project state tracking file documenting existing features for gift pack navigation and detail pages, with one pending feature request to make gift pack tiles clickable."
}