{
  "backend/main.mo": "Main Motoko actor defining all data types (GiftPack, Cart, Order, Coupon, UserProfile, etc.) and in-memory Map storage for gift packs, orders, coupons, categories, user profiles, carts, payments, and contact submissions with delivery pincode validation.",
  "feature_evidence.json": "Feature evidence report documenting four implemented features: edit buttons in GiftPackList, useGiftPackMutation hook with update support, GiftPackManagement handling create/edit modes, and edit functionality for categories, coupons, and products in admin dashboard.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend components including pages (Home, Catalog, Custom, Cart, Checkout, etc.), layout components (Header, Footer), product components (GiftPackCard, FilterSidebar), and cart/customization components with their key functionality and state management.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes defining colors for background, foreground, primary, secondary, muted, accent, destructive, borders, and sidebar components using oklch color space.",
  "frontend/index.html": "HTML entry point loading Razorpay checkout script and mounting the React app at #root div with main.tsx module.",
  "frontend/src/App.tsx": "Root application component configuring TanStack Router with all routes, ThemeProvider, automatic dummy data initialization, and login/logout detection that syncs cart from backend on login and clears cart completely on logout.",
  "frontend/src/components/admin/CategoryForm.tsx": "Reusable form component for creating and editing categories with name and description fields, supporting both create and edit modes with pre-filled data and cancel functionality.",
  "frontend/src/components/admin/CategoryList.tsx": "Displays list of categories with loading skeletons, empty state, and edit buttons that trigger onEdit callback for each category.",
  "frontend/src/components/admin/CategoryManagement.tsx": "Admin component for managing categories with create/edit forms and a list view. Handles category creation, updates, and editing state using custom hooks and displays toast notifications.",
  "frontend/src/components/admin/CouponForm.tsx": "Form component for creating and editing coupons with fields for code, discount percentage, min/max discount constraints, expiration date, and quantity. Uses react-hook-form for validation and handles date conversion to/from nanoseconds.",
  "frontend/src/components/admin/CouponList.tsx": "Displays a grid of coupon cards showing code, discount details, quantity remaining, expiration date, and status badges (Active/Expired/Sold Out). Includes edit functionality and handles expired/sold-out states.",
  "frontend/src/components/admin/CouponManagement.tsx": "Admin component for managing coupons that combines CouponForm and CouponList. Handles coupon creation, updates, and date conversion to nanoseconds for backend storage.",
  "frontend/src/components/admin/GiftPackForm.tsx": "Form component for creating and editing gift packs with fields for ID, title, description, price, discount, category, image URL, basket type, and size. Uses react-hook-form with Controller for select inputs.",
  "frontend/src/components/admin/GiftPackList.tsx": "Displays a grid of gift pack cards with images, titles, descriptions, pricing (with discount calculations), category badges, and edit buttons. Includes helper functions for formatting basket types, sizes, and categories.",
  "frontend/src/components/admin/GiftPackManagement.tsx": "Admin component that manages gift packs with create/edit forms and a list view, using hooks for data fetching and mutations with toast notifications for success/error feedback.",
  "frontend/src/components/admin/ProductForm.tsx": "React Hook Form-based form component for creating/editing gift pack products with fields for ID, title, description, price, discount, category, image URL, basket type, and size with validation.",
  "frontend/src/components/admin/ProductManagement.tsx": "Admin component for creating new gift pack products using ProductForm and useProductMutation hook with toast notifications and form reset on success.",
  "frontend/src/components/cart/CartItemRow.tsx": "Displays a single cart item with image, details, quantity controls (increment/decrement), remove button, and calculates item total with discount; handles custom packs and loading states.",
  "frontend/src/components/cart/CartSummary.tsx": "Shows cart summary card with subtotal, GST (18%), and total calculations, plus a checkout button that navigates to the checkout page when clicked.",
  "frontend/src/components/checkout/AddressForm.tsx": "Delivery address form that pre-fills from user profile, validates pincode serviceability via backend actor, validates phone numbers, and submits address data with real-time pincode checking feedback.",
  "frontend/src/components/checkout/OrderSummary.tsx": "Displays order summary with item list, subtotal, optional coupon discount, GST calculation, and total amount formatted in Indian rupees.",
  "frontend/src/components/customization/BasketTypeSelector.tsx": "Grid of selectable basket type cards (wicker basket, wooden crate, gift box) with icons, descriptions, and visual feedback for the selected option.",
  "frontend/src/components/customization/ItemSelector.tsx": "Displays a grid of selectable gift items with mock data, allowing users to toggle items up to a configurable maximum (default 12) with visual feedback for selection state and limit reached.",
  "frontend/src/components/customization/MessageCardForm.tsx": "Provides a textarea for users to add an optional personalized message (max 200 characters) with a character counter.",
  "frontend/src/components/customization/PackingTypeSelector.tsx": "Renders a grid of four packing type options (wrap styles and ribbon colors) as selectable cards with icons and descriptions.",
  "frontend/src/components/customization/PackPreview.tsx": "Displays a sticky sidebar preview of the custom gift pack showing basket type, size, selected items with prices, packing style, message card, and total price calculation.",
  "frontend/src/components/customization/PersonalizationForm.tsx": "Empty file with no content.",
  "frontend/src/components/customization/SizeSelector.tsx": "Displays three size options (Small, Medium, Large) as selectable cards showing capacity, description, and additional pricing.",
  "frontend/src/components/customization/StepIndicator.tsx": "Shows a horizontal progress indicator with 5 steps (Basket Type, Size, Products, Packing, Message) displaying completion status with checkmarks and connecting lines.",
  "frontend/src/components/customization/StepNavigation.tsx": "Provides Back and Next navigation buttons for multi-step forms with conditional enabling based on current step and validation state.",
  "frontend/src/components/delivery/PincodeChecker.tsx": "Allows users to input a 6-digit pincode and checks delivery serviceability via actor backend, displaying validation results with success/error messages.",
  "frontend/src/components/layout/Footer.tsx": "Footer component displaying company info, quick links, delivery details, social media icons, and a copyright notice with attribution to caffeine.ai.",
  "frontend/src/components/layout/Header.tsx": "Header component with navigation, cart badge, Internet Identity authentication, and a pincode serviceability checker with popover UI for both desktop and mobile views.",
  "frontend/src/components/layout/Layout.tsx": "Main layout wrapper component that renders the Header, page content via Outlet, and Footer in a flex column structure.",
  "frontend/src/components/product/FilterSidebar.tsx": "Filter sidebar component for catalog browsing with category checkboxes and price range slider, available as desktop card or mobile sheet.",
  "frontend/src/components/product/GiftPackCard.tsx": "Gift pack card component displaying product image, title, description, price with discount badge, category badge, and add-to-cart button.",
  "frontend/src/components/product/ProductGrid.tsx": "Grid layout component that renders a list of GiftPackCard components or displays an empty state when no products are found.",
  "frontend/src/components/profile/OrderHistoryCard.tsx": "Order history card displaying order details including ID, date, status badges, payment status, total amount, and expandable item list.",
  "frontend/src/components/profile/OrderHistorySection.tsx": "Order history section that fetches and displays user orders sorted by date, with loading skeletons, error handling, and empty state.",
  "frontend/src/hooks/useActor.ts": "Manages the backend actor instance using React Query, creating authenticated or anonymous actors based on Internet Identity state and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useCart.ts": "Provides cart management functionality with localStorage persistence and backend synchronization, including add/remove/update operations and total calculation with coupon support.",
  "frontend/src/hooks/useCategories.ts": "React Query hook that fetches all categories from the backend actor.",
  "frontend/src/hooks/useCategoryMutation.ts": "Provides mutations for creating and updating categories with query cache invalidation; update functionality is a placeholder awaiting backend implementation.",
  "frontend/src/hooks/useContactForm.ts": "React Query mutation hook for submitting contact form data to the backend actor.",
  "frontend/src/hooks/useCoupon.ts": "Provides coupon validation mutation and a utility function to calculate discount amounts based on coupon percentage.",
  "frontend/src/hooks/useCouponMutation.ts": "Provides mutations for creating and updating coupons with BigInt conversions; includes a placeholder query for fetching all coupons awaiting backend implementation.",
  "frontend/src/hooks/useGiftPackMutation.ts": "Provides mutations for creating and updating gift packs with price/discount BigInt conversion and ExternalBlob image handling, invalidating gift pack queries on success.",
  "frontend/src/hooks/useGiftPacks.ts": "Provides React Query hooks for fetching all gift packs, filtered gift packs by catalog filters, and individual gift packs by ID.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context and hooks with login/logout functionality, identity persistence, and configurable AuthClient options including derivation origin support.",
  "frontend/src/hooks/useOrder.ts": "Mutation hook for creating orders with cart items, delivery details, payment info, and optional coupon code, invalidating order history on success.",
  "frontend/src/hooks/useOrderHistory.ts": "React Query hook that fetches the user's order history from the backend actor with error handling.",
  "frontend/src/hooks/useProductMutation.ts": "Mutation hook for creating products with BigInt price/discount conversion and ExternalBlob image handling, invalidating gift pack queries on success.",
  "frontend/src/hooks/useQueries.ts": "Mutation hook for initializing backend data that invalidates gift pack queries on success.",
  "frontend/src/hooks/useRazorpay.ts": "Custom React hook for integrating Razorpay payment gateway, handling payment initiation with order details, processing states, and success/failure callbacks.",
  "frontend/src/hooks/useUserProfile.ts": "React hook using TanStack Query to fetch and update user profile data from the backend actor, including delivery address and contact information.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom color palette (terracotta, sage green, cream) for light/dark themes, typography settings, and utility classes.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient and InternetIdentityProvider wrappers around the main App component.",
  "frontend/src/pages/AdminPage.tsx": "Admin dashboard page displaying management interfaces for categories, products, coupons, and gift packs in separate card sections.",
  "frontend/src/pages/CartPage.tsx": "Shopping cart page showing cart items with CartItemRow components, CartSummary sidebar, and empty state with navigation to catalog/custom pack creation.",
  "frontend/src/pages/CatalogPage.tsx": "Product catalog page with search bar, filter sidebar, and product grid displaying gift packs with loading skeletons and filter state management.",
  "frontend/src/pages/CheckoutPage.tsx": "Checkout page handling address input, coupon validation/application, order summary, and Razorpay payment integration with authentication checks and cart validation.",
  "frontend/src/pages/ContactPage.tsx": "Contact form page with react-hook-form validation for name, email, phone, and message fields, displaying success/error alerts after submission.",
  "frontend/src/pages/CustomPackPage.tsx": "Multi-step form page for creating custom gift packs with basket type, size, product selection, packing type, and message card options, then adding to cart.",
  "frontend/src/pages/HomePage.tsx": "Landing page with hero section, feature highlights, and featured gift packs display using useGiftPacks hook.",
  "frontend/src/pages/OrderConfirmationPage.tsx": "Order confirmation page displaying order ID, estimated delivery date, and payment status after successful checkout.",
  "frontend/src/pages/ProfilePage.tsx": "User profile management page with form for updating personal details, delivery address, pincode serviceability check, and order history section.",
  "frontend/src/types/razorpay.d.ts": "TypeScript type definitions for Razorpay payment gateway integration including options, response, and instance interfaces.",
  "frontend/src/utils/validation.ts": "Utility functions for validating Indian pincodes (6 digits) and phone numbers (10 digits) with delivery availability check placeholder.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom color palette (terracotta, sage, cream), typography, animations, and design tokens for the gift pack application.",
  "project_state.json": "Project state tracking file documenting existing features for admin edit functionality and pending feature requests for gift pack updates."
}