{
  "backend/main.mo": "Main backend actor defining all types (GiftPack, Order, Cart, UserProfile, Coupon, etc.), CRUD operations for gift packs/products/categories/coupons, cart management, order processing with Razorpay integration, and delivery pincode validation using Map-based storage.",
  "feature_evidence.json": "Feature evidence report documenting three completed features: adding GiftPackManagement to AdminPage, updating useGiftPackMutation hook to use backend CRUD methods, and adding delete functionality to GiftPackList component.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend components and pages including routing, cart management, checkout flow, admin panels, product displays, and custom pack builder with state synchronization on login/logout.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes defining colors for background, foreground, primary, secondary, muted, accent, destructive, borders, and sidebar components.",
  "frontend/index.html": "HTML entry point with Razorpay checkout script integration and root div for React application mounting.",
  "frontend/src/App.tsx": "Root application component configuring TanStack Router with all routes, ThemeProvider, automatic dummy data initialization, and login/logout detection that syncs cart from backend on login and clears cart on logout.",
  "frontend/src/components/admin/CategoryForm.tsx": "Reusable form component for creating and editing categories with name and description fields, validation, loading states, and cancel functionality for edit mode.",
  "frontend/src/components/admin/CategoryList.tsx": "Displays list of categories with loading skeletons, empty state message, and optional edit button for each category card showing name and description.",
  "frontend/src/components/admin/CategoryManagement.tsx": "Main component for managing categories, integrating CategoryForm and CategoryList with create/update mutations and toast notifications. Handles editing state and form submission for both creating new categories and updating existing ones.",
  "frontend/src/components/admin/CouponForm.tsx": "React Hook Form-based form component for creating and editing coupons with fields for code, discount percentage, min/max discount constraints, expiration date, and quantity. Handles date conversion from nanoseconds and enforces uppercase coupon codes.",
  "frontend/src/components/admin/CouponList.tsx": "Displays a grid of coupon cards showing code, discount details, quantity remaining, expiration date, and status badges (Active/Expired/Sold Out). Includes edit functionality and handles date conversion from bigint nanoseconds.",
  "frontend/src/components/admin/CouponManagement.tsx": "Main component for managing coupons, integrating CouponForm and CouponList with create/update mutations. Converts expiration dates to bigint nanoseconds for backend compatibility and handles editing state.",
  "frontend/src/components/admin/GiftPackForm.tsx": "React Hook Form-based form component for creating and editing gift packs with fields for ID, title, description, price, discount, category, image URL, basket type, and size. Uses controlled Select components for enum-based fields.",
  "frontend/src/components/admin/GiftPackList.tsx": "Displays a grid of gift pack cards with images, details, and action buttons for editing and deleting. Includes an AlertDialog for delete confirmation and formats enum values for display.",
  "frontend/src/components/admin/GiftPackManagement.tsx": "Main component for managing gift packs, integrating GiftPackForm and GiftPackList with create/update/delete mutations. Handles editing state and coordinates form submission and deletion operations.",
  "frontend/src/components/admin/ProductForm.tsx": "React form component using react-hook-form for creating/editing products with fields for ID, name, description, price, category, and image URL. Supports validation, loading states, and initial data for editing mode.",
  "frontend/src/components/admin/ProductList.tsx": "Displays a grid of product cards with edit and delete actions, using useCustomProducts hook. Shows loading skeletons, error states, and empty states with product details including image, category badge, and price.",
  "frontend/src/components/admin/ProductManagement.tsx": "Main admin component that orchestrates product CRUD operations by combining ProductForm and ProductList. Manages state for showing/hiding form, editing products, and handles create/update/delete mutations with toast notifications.",
  "frontend/src/components/cart/CartItemRow.tsx": "Renders individual cart item with product image, title, category badge, custom message, wrapping option, quantity controls, and remove button. Fetches pack details by ID and calculates item total with discount.",
  "frontend/src/components/cart/CartSummary.tsx": "Displays cart summary card with subtotal, GST (18%), and total price calculations. Includes a 'Proceed to Checkout' button that navigates to checkout page when cart has items.",
  "frontend/src/components/checkout/AddressForm.tsx": "Form component for delivery address input with real-time pincode serviceability validation using backend actor. Pre-fills data from user profile and validates phone/pincode before submission with visual status indicators.",
  "frontend/src/components/checkout/OrderSummary.tsx": "Displays a checkout order summary card showing cart items, subtotal, coupon discount, GST (18%), and total price with loading skeleton states.",
  "frontend/src/components/customization/BasketTypeSelector.tsx": "Renders a grid of selectable basket type cards (Wicker Basket, Wooden Crate, Gift Box) with icons, descriptions, and visual selection states.",
  "frontend/src/components/customization/ItemSelector.tsx": "Displays a grid of selectable gift items with a maximum item limit, showing mock products with prices, descriptions, and checkboxes for multi-selection.",
  "frontend/src/components/customization/MessageCardForm.tsx": "Provides a textarea for entering an optional gift message with a 200-character limit and remaining character counter.",
  "frontend/src/components/customization/PackingTypeSelector.tsx": "Displays a grid of selectable packing style options (Classic Wrap, Premium Wrap, Gold Ribbon, Silver Ribbon) with color-coded visual indicators.",
  "frontend/src/components/customization/PackPreview.tsx": "Shows a sticky sidebar preview of the custom gift pack including basket type, size, selected items with prices, packing style, message card, and total price calculation.",
  "frontend/src/components/customization/PersonalizationForm.tsx": "Empty component file with no content.",
  "frontend/src/components/customization/SizeSelector.tsx": "Renders three size options (Small, Medium, Large) as selectable cards showing capacity, description, and additional pricing for each size tier.",
  "frontend/src/components/customization/StepIndicator.tsx": "Displays a horizontal progress indicator with five steps (Basket Type, Size, Products, Packing, Message) showing completed, current, and upcoming states.",
  "frontend/src/components/customization/StepNavigation.tsx": "Provides Back and Next navigation buttons for multi-step forms with disabled states based on current step and validation.",
  "frontend/src/components/delivery/PincodeChecker.tsx": "A standalone card component that allows users to input a 6-digit pincode and check delivery availability by calling the backend actor's isPincodeServiceable method, displaying success or error states with icons.",
  "frontend/src/components/layout/Footer.tsx": "Footer component displaying company info, quick links, delivery details, social media icons, copyright notice, and a caffeine.ai attribution link with heart icon.",
  "frontend/src/components/layout/Header.tsx": "Main navigation header with logo, desktop/mobile menus, pincode checker popover, cart badge, and Internet Identity login/logout functionality.",
  "frontend/src/components/layout/Layout.tsx": "Root layout wrapper that renders Header, main content outlet, and Footer in a flex column structure.",
  "frontend/src/components/product/FilterSidebar.tsx": "Filter sidebar component (desktop card and mobile sheet) allowing users to filter gift packs by category checkboxes and price range slider, with a clear all button.",
  "frontend/src/components/product/GiftPackCard.tsx": "Gift pack card component displaying product image, title, description, category badge, price with optional discount, and an add-to-cart button that integrates with the cart hook.",
  "frontend/src/components/product/ProductGrid.tsx": "Grid layout component that renders a responsive grid of GiftPackCard components or displays an empty state message when no gift packs are available.",
  "frontend/src/components/profile/OrderHistoryCard.tsx": "Displays a single order in a collapsible card with order details, status badges (pending/confirmed/shipped/delivered/cancelled), payment status, total amount, and expandable item list with optional message card display.",
  "frontend/src/components/profile/OrderHistorySection.tsx": "Renders the order history section with loading/error states, fetches orders using useOrderHistory hook, sorts them by date (most recent first), and displays them using OrderHistoryCard components or an empty state.",
  "frontend/src/hooks/useActor.ts": "Manages the backend actor instance with authentication, creating authenticated or anonymous actors based on Internet Identity, and invalidates/refetches dependent queries when the actor changes.",
  "frontend/src/hooks/useCart.ts": "Manages shopping cart state with localStorage persistence and backend synchronization, providing functions to add/remove/update items, calculate totals with coupon discounts, and handle cart clearing.",
  "frontend/src/hooks/useCategories.ts": "React Query hook that fetches all categories from the backend actor using getAllCategories method.",
  "frontend/src/hooks/useCategoryMutation.ts": "Provides mutation hooks for creating and updating categories (update is placeholder), invalidating the categories query cache on success.",
  "frontend/src/hooks/useContactForm.ts": "Mutation hook for submitting contact form data (name, email, phone, message) to the backend actor's submitContactForm method.",
  "frontend/src/hooks/useCoupon.ts": "Provides coupon validation mutation that checks coupon codes with the backend and a utility function to calculate percentage-based discount amounts.",
  "frontend/src/hooks/useCouponMutation.ts": "Provides mutations for creating and updating coupons with discount percentages, min/max amounts, expiration dates, and quantities; includes a placeholder useAllCoupons query that returns empty array.",
  "frontend/src/hooks/useCustomProducts.ts": "React Query hook that fetches all products from the backend actor using getAllProducts method.",
  "frontend/src/hooks/useGiftPackMutation.ts": "Provides mutations for creating, updating, and deleting gift packs with validation, toast notifications, and automatic query cache invalidation for giftPacks queries.",
  "frontend/src/hooks/useGiftPacks.ts": "Provides three React Query hooks: useGiftPacks for all gift packs, useFilteredGiftPacks for filtered results, and useGiftPackById for fetching a single gift pack by ID.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for Internet Identity authentication, managing login state, identity storage, and delegation validation with configurable AuthClient options.",
  "frontend/src/hooks/useOrder.ts": "Exports a mutation hook for creating orders with cart items, delivery details, and payment information, invalidating order history queries on success.",
  "frontend/src/hooks/useOrderHistory.ts": "Provides a query hook to fetch user order history from the backend actor, returning an empty array on error or when actor is unavailable.",
  "frontend/src/hooks/useProductMutation.ts": "Exports mutation hooks for creating, updating, and deleting custom products with category and pricing, though delete functionality is not yet implemented in the backend.",
  "frontend/src/hooks/useQueries.ts": "Provides a mutation hook to initialize backend data, invalidating gift pack queries upon successful completion.",
  "frontend/src/hooks/useRazorpay.ts": "Implements Razorpay payment integration with order details prefill, handling payment success/failure callbacks and modal dismissal events.",
  "frontend/src/hooks/useUserProfile.ts": "Provides query and mutation hooks for fetching and updating user profile data including name, email, phone, address, and pincode.",
  "frontend/src/index.css": "Defines Tailwind CSS configuration with a warm terracotta/sage/cream color palette using OKLCH color space, supporting both light and dark modes.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query client and Internet Identity provider, rendering the root App component.",
  "frontend/src/pages/AdminPage.tsx": "Admin dashboard page displaying management interfaces for products, categories, coupons, and gift packs in separate card sections.",
  "frontend/src/pages/CartPage.tsx": "Shopping cart page displaying cart items with summary, showing empty state with navigation options when cart is empty.",
  "frontend/src/pages/CatalogPage.tsx": "Gift pack catalog page with search bar, filter sidebar, and product grid, displaying loading skeletons while fetching data.",
  "frontend/src/pages/CheckoutPage.tsx": "Checkout page component that handles user authentication, address input, coupon application, order creation, and Razorpay payment integration. Displays order summary with cart items, calculates totals with discounts, and redirects to order confirmation after successful payment.",
  "frontend/src/pages/ContactPage.tsx": "Contact form page with validation for name, email, phone, and message fields. Uses react-hook-form for form management and displays success/error alerts after submission via useContactForm hook.",
  "frontend/src/pages/CustomPackPage.tsx": "Multi-step custom gift pack builder with 5 steps: basket type selection, size selection, product item selection, packing type, and optional message card. Validates each step before proceeding and adds the configured custom pack to cart.",
  "frontend/src/pages/HomePage.tsx": "Landing page with hero section, feature highlights (curated collections, personalization, delivery), and featured gift packs display. Provides navigation to catalog and custom pack creation.",
  "frontend/src/pages/OrderConfirmationPage.tsx": "Order confirmation page displaying order ID, estimated delivery date, and payment information retrieved from session storage. Shows success state with order details and navigation back to home.",
  "frontend/src/pages/ProfilePage.tsx": "User profile page component with form for editing personal details and delivery address, includes pincode serviceability checking and order history display.",
  "frontend/src/types/razorpay.d.ts": "TypeScript type definitions for Razorpay payment gateway integration including options, response, and instance interfaces.",
  "frontend/src/utils/validation.ts": "Utility functions for validating Indian pincodes (6 digits) and phone numbers (10 digits), with delivery availability checking placeholder.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom color palette (terracotta, sage, cream), typography settings, animations, and design system tokens using OKLCH color space.",
  "project_state.json": "Project state tracking file documenting existing gift pack management features and pending feature requests for admin CRUD operations."
}