{
  "backend/main.mo": "Main Motoko actor defining gift pack e-commerce types (GiftItem, GiftPack, Cart, Order, etc.) with category/basket/size enums, storage maps for gift packs and orders, and public functions for initialization, querying, searching, filtering, cart management, and order creation.",
  "backend/migration.mo": "Migration module with a run function that currently returns the old actor unchanged, providing a placeholder for future data migration logic.",
  "feature_evidence.json": "Empty feature evidence report JSON file with no features documented.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend React/TypeScript components including pages (home, catalog, custom pack, cart, checkout, confirmation), layout components (header, footer), product components (cards, filters, grids), and customization/cart/checkout components with their key functionality.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes defining colors for UI elements (background, foreground, primary, secondary, muted, accent, destructive, borders, charts, sidebar) using oklch color space.",
  "frontend/index.html": "HTML entry point with root div and module script loading main.tsx, titled 'Gift Pack Store'.",
  "frontend/src/App.tsx": "Root React component setting up TanStack Router with routes for home, catalog, custom pack, cart, checkout, and order confirmation pages, wrapped in ThemeProvider with Toaster for notifications.",
  "frontend/src/components/cart/CartItemRow.tsx": "Cart item row component displaying gift pack details with image, title, category badge, custom message, wrapping option, quantity controls (plus/minus buttons), remove button, and calculated item total price.",
  "frontend/src/components/cart/CartSummary.tsx": "Order summary card showing subtotal, 18% GST tax, total amount in Indian Rupees, and proceed-to-checkout button using cart hook for calculations.",
  "frontend/src/components/checkout/AddressForm.tsx": "Delivery address form with react-hook-form validation for name, phone (10 digits), street address, city, state (dropdown of Indian states), and pincode with custom validation functions.",
  "frontend/src/components/checkout/OrderSummary.tsx": "Displays a checkout order summary card showing cart items, subtotal, 18% GST tax, and total price in INR. Uses the useCart hook to retrieve cart data.",
  "frontend/src/components/customization/BasketTypeSelector.tsx": "Renders a grid of selectable basket type cards (Wicker Basket, Wooden Crate, Gift Box) with icons and descriptions. Highlights the selected type with a terracotta ring.",
  "frontend/src/components/customization/ItemSelector.tsx": "Allows users to select up to a maximum number of gift items from a mock catalog, displaying items in a grid with checkboxes. Shows an alert with current selection count and enforces the item limit.",
  "frontend/src/components/customization/MessageCardForm.tsx": "Provides a textarea for users to add an optional personalized message (max 200 characters) to their gift. Displays remaining character count.",
  "frontend/src/components/customization/PackingTypeSelector.tsx": "Displays a grid of packing style options (Classic Wrap, Premium Wrap, Gold Ribbon, Silver Ribbon) with color-coded cards. Highlights the selected packing type.",
  "frontend/src/components/customization/PackPreview.tsx": "Shows a sticky preview card of the custom gift pack configuration including basket type, size, selected items with prices, packing style, and message. Calculates and displays total price with size-based pricing.",
  "frontend/src/components/customization/PersonalizationForm.tsx": "Empty file with no content.",
  "frontend/src/components/customization/SizeSelector.tsx": "Renders three size options (Small, Medium, Large) as cards showing capacity, description, and additional price. Highlights the selected size with a terracotta ring.",
  "frontend/src/components/customization/StepIndicator.tsx": "Displays a horizontal progress indicator for a 5-step customization flow (Basket Type, Size, Products, Packing, Message). Shows completed steps with checkmarks and highlights the current step.",
  "frontend/src/components/customization/StepNavigation.tsx": "Provides Back and Next navigation buttons for the customization flow. Disables Back on step 1 and Next when canProceed is false.",
  "frontend/src/components/layout/Footer.tsx": "Renders a site footer with four columns (About, Quick Links, Delivery Info, Social) and copyright notice. Includes social media icons and a caffeine.ai attribution link.",
  "frontend/src/components/layout/Header.tsx": "Main header component with navigation, cart badge, Internet Identity login/logout, and responsive mobile menu using Sheet component.",
  "frontend/src/components/layout/Layout.tsx": "Root layout component that wraps pages with Header, main content area (Outlet), and Footer in a flex column structure.",
  "frontend/src/components/product/FilterSidebar.tsx": "Sidebar filter component for catalog with category checkboxes and price range slider; renders as Card on desktop and Sheet on mobile.",
  "frontend/src/components/product/GiftPackCard.tsx": "Gift pack card component displaying product image, title, category badge, price, and add-to-cart button with hover effects.",
  "frontend/src/components/product/ProductGrid.tsx": "Responsive grid layout for displaying gift pack cards with empty state when no products match filters.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages the backend actor instance based on Internet Identity authentication state, invalidating dependent queries on identity changes.",
  "frontend/src/hooks/useCart.ts": "Cart state management hook using localStorage for persistence, providing add/update/remove operations and calculating item count, subtotal, tax, and total.",
  "frontend/src/hooks/useGiftPacks.ts": "React Query hooks for fetching all gift packs, filtered gift packs by criteria, and individual gift pack by ID from the backend actor.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context provider and hook for Internet Identity authentication, managing AuthClient lifecycle, login/logout flows, and identity state with delegation validation.",
  "frontend/src/hooks/useOrder.ts": "React Query mutation hook for creating orders with cart items, delivery address, and customization options (basket type, size, packing, message card).",
  "frontend/src/index.css": "Tailwind CSS configuration with custom design tokens defining a warm color palette (terracotta, sage green, cream) for both light and dark modes, plus utility classes for the custom colors.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient for data fetching and InternetIdentityProvider for authentication context.",
  "frontend/src/pages/CartPage.tsx": "Shopping cart page displaying cart items with CartItemRow components, CartSummary sidebar, and empty state with navigation to catalog or custom pack creation.",
  "frontend/src/pages/CatalogPage.tsx": "Product catalog page with search bar, FilterSidebar for filtering, and ProductGrid displaying gift packs with loading skeletons.",
  "frontend/src/pages/CheckoutPage.tsx": "Checkout page with AddressForm and OrderSummary that creates orders via useCreateOrder mutation, requires authentication, and redirects to confirmation on success.",
  "frontend/src/pages/CustomPackPage.tsx": "Multi-step custom gift pack builder with 5 steps (basket type, size, items, packing, message) using step navigation and preview, adding completed pack to cart.",
  "frontend/src/pages/HomePage.tsx": "Landing page with hero section, three feature cards (curated collections, personalization, delivery), and featured gift packs grid with loading skeletons.",
  "frontend/src/pages/OrderConfirmationPage.tsx": "Order confirmation page displaying order ID, estimated delivery date (7 days), and navigation buttons to continue shopping or browse catalog.",
  "frontend/src/utils/validation.ts": "Validation utilities for Indian pincode (6 digits), phone number (10 digits), and delivery availability checking.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color palette (terracotta, sage, cream), typography (Playfair Display serif, Inter sans-serif), container settings, border radius variables, custom shadows, and accordion animations with plugins for typography, container queries, and animations.",
  "project_state.json": "Project state tracking document for a mobile-first e-commerce gift pack website with features including homepage, product catalog, custom gift pack builder (basket→size→products→packing→message flow), shopping cart, checkout, and India-focused delivery/payment systems."
}