{
  "backend/main.mo": "Main Motoko actor defining the gift pack e-commerce backend with types for gift items, packs, carts, orders, payments, coupons, and user profiles, plus in-memory Map storage for all entities and delivery pincode validation.",
  "backend/migration.mo": "Migration module defining type aliases matching main.mo and providing a run function to migrate from OldActor (single imageUrl) to NewActor (images array) by transforming Product types.",
  "feature_evidence.json": "Feature evidence report documenting six high-confidence features for updating ProductForm, GiftPackForm, ProductList, GiftPackList, and GiftPackCard components to support multiple image URLs with dynamic lists and carousels.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend components describing their functionality, including pages (home, catalog, cart, checkout), layout components (header, footer), product components (cards, grids, filters), and admin components with multi-image support.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes, defining colors for UI elements like backgrounds, borders, cards, and charts using oklch color space.",
  "frontend/index.html": "HTML entry point loading the React app with Razorpay checkout script included for payment integration.",
  "frontend/src/App.tsx": "Root React component configuring TanStack Router with all application routes, ThemeProvider, automatic data initialization, and login/logout detection that syncs or clears cart state accordingly.",
  "frontend/src/components/admin/CategoryForm.tsx": "React form component for creating and editing categories with name and description fields, using react-hook-form for validation and state management.",
  "frontend/src/components/admin/CategoryList.tsx": "Displays a list of categories in card format with loading skeletons, empty state, and optional edit functionality for each category.",
  "frontend/src/components/admin/CategoryManagement.tsx": "Container component that combines CategoryForm and CategoryList, managing category creation, editing, and state with toast notifications for success/error feedback.",
  "frontend/src/components/admin/CouponForm.tsx": "React form component for creating and editing coupons with fields for code, discount percentage, min/max discount amounts, expiration date, and quantity using react-hook-form.",
  "frontend/src/components/admin/CouponList.tsx": "Displays coupons in a grid of cards showing discount details, expiration dates, remaining quantities, and active/expired/sold-out status badges with optional edit functionality.",
  "frontend/src/components/admin/CouponManagement.tsx": "Container component that combines CouponForm and CouponList, managing coupon creation, editing, and state with date conversion to bigint timestamps and toast notifications.",
  "frontend/src/components/admin/GiftPackForm.tsx": "React form component for creating and editing gift packs with fields for ID, title, description, price, discount, category, images array, basket type, and size using react-hook-form with field arrays.",
  "frontend/src/components/admin/GiftPackList.tsx": "Displays a grid of gift pack cards with edit/delete actions, showing loading skeletons, error states, and empty states with images, titles, descriptions, pricing, and discount badges.",
  "frontend/src/components/admin/GiftPackManagement.tsx": "Manages gift pack CRUD operations by coordinating between GiftPackForm and GiftPackList components, handling create/update/delete mutations and edit state.",
  "frontend/src/components/admin/ProductForm.tsx": "React Hook Form-based form for creating/editing custom products with fields for ID, name, description, price, category selection, and dynamic image URL array management.",
  "frontend/src/components/admin/ProductList.tsx": "Displays a grid of product cards with edit/delete actions, showing loading skeletons, error states, and empty states with product images, names, descriptions, prices, and category badges.",
  "frontend/src/components/admin/ProductManagement.tsx": "Manages custom product CRUD operations with toast notifications, coordinating between ProductForm and ProductList components with a toggleable form view and confirmation dialogs for deletion.",
  "frontend/src/components/cart/CartItemRow.tsx": "Renders a single cart item row displaying gift pack details, quantity controls with increment/decrement buttons, optional custom message and wrapping, calculated pricing with discounts, and a remove button.",
  "frontend/src/components/cart/CartSummary.tsx": "Displays cart totals including subtotal, GST (18%), and final total in a card component with a checkout button that navigates to the checkout page.",
  "frontend/src/components/checkout/AddressForm.tsx": "Form component for collecting and validating delivery address details with pincode serviceability checking via backend actor. Pre-fills address from user profile and validates phone/pincode before submission.",
  "frontend/src/components/checkout/OrderSummary.tsx": "Displays order summary card showing cart items, subtotal, coupon discount, GST (18%), and total price. Uses cart and gift packs hooks to calculate totals.",
  "frontend/src/components/customization/BasketTypeSelector.tsx": "Grid of selectable basket type cards (wicker basket, wooden crate, gift box) with icons and descriptions. Highlights selected type with ring styling.",
  "frontend/src/components/customization/ItemSelector.tsx": "Grid component for selecting gift items up to a configurable maximum, using mock data. Shows selection count alert and disables items when limit is reached.",
  "frontend/src/components/customization/MessageCardForm.tsx": "Textarea form for adding an optional personalized message (max 200 characters) to the gift pack. Displays remaining character count.",
  "frontend/src/components/customization/PackingTypeSelector.tsx": "Grid of selectable packing style cards (classic wrap, premium wrap, gold/silver ribbons) with color-coded icons. Highlights selected packing type.",
  "frontend/src/components/customization/PackPreview.tsx": "Sticky sidebar preview showing selected basket type, size, items list with remove buttons, packing style, message card, and calculated total price. Displays all customization choices.",
  "frontend/src/components/customization/PersonalizationForm.tsx": "Empty file with no content.",
  "frontend/src/components/customization/SizeSelector.tsx": "Grid of selectable size cards (small, medium, large) showing item capacity, description, and additional price. Highlights selected size with terracotta ring.",
  "frontend/src/components/customization/StepIndicator.tsx": "Displays a horizontal step indicator for the gift customization flow with 5 steps (Basket Type, Size, Products, Packing, Message), showing completed, current, and upcoming states with visual styling.",
  "frontend/src/components/customization/StepNavigation.tsx": "Provides Back and Next navigation buttons for the customization stepper, with the Back button disabled on step 1 and Next button disabled when canProceed is false.",
  "frontend/src/components/delivery/PincodeChecker.tsx": "A card component that allows users to check delivery availability by entering a 6-digit pincode, validates the input, and calls the backend actor to determine if the pincode is serviceable.",
  "frontend/src/components/layout/Footer.tsx": "Renders the site footer with four columns (About, Quick Links, Delivery Info, Social), navigation links, social media icons, copyright notice, and a caffeine.ai attribution link.",
  "frontend/src/components/layout/Header.tsx": "Main navigation header with logo, desktop/mobile navigation menus, pincode checker popover, cart icon with item count badge, and Internet Identity login/logout functionality.",
  "frontend/src/components/layout/Layout.tsx": "Root layout component that wraps pages with Header, main content area (Outlet), and Footer in a flex column structure.",
  "frontend/src/components/product/FilterSidebar.tsx": "Provides filtering UI for the catalog with category checkboxes and price range slider, rendered as a desktop sidebar card or mobile sheet, with clear all functionality.",
  "frontend/src/components/product/GiftPackCard.tsx": "Displays a gift pack as a card with image carousel, title, description, category badge, pricing with discount, and add-to-cart button with loading state.",
  "frontend/src/components/product/ProductGrid.tsx": "Displays a grid of gift pack cards with add-to-cart functionality, showing an empty state when no products are found.",
  "frontend/src/components/profile/OrderHistoryCard.tsx": "Renders an expandable card for a single order showing status badges, total amount, order date, and collapsible item details.",
  "frontend/src/components/profile/OrderHistorySection.tsx": "Displays user's order history with loading states, error handling, and an empty state when no orders exist.",
  "frontend/src/hooks/useActor.ts": "Manages the backend actor instance with authentication, creating anonymous or authenticated actors based on Internet Identity and invalidating dependent queries on actor changes.",
  "frontend/src/hooks/useCart.ts": "Manages cart state with localStorage persistence, backend synchronization, and provides functions for adding/removing items, updating quantities, and calculating totals with coupon support.",
  "frontend/src/hooks/useCategories.ts": "Fetches all categories from the backend actor using React Query.",
  "frontend/src/hooks/useCategoryMutation.ts": "Provides mutations for creating and updating categories with automatic query invalidation on success.",
  "frontend/src/hooks/useContactForm.ts": "Handles contact form submission by calling the backend actor's submitContactForm method.",
  "frontend/src/hooks/useCoupon.ts": "Validates coupon codes via backend actor and calculates discount amounts based on coupon percentage.",
  "frontend/src/hooks/useCouponMutation.ts": "Provides mutations for creating and updating coupons, plus a query hook to fetch all coupons (currently returns empty array as backend method is not implemented).",
  "frontend/src/hooks/useCustomProducts.ts": "Fetches all custom products from the backend actor using React Query.",
  "frontend/src/hooks/useGiftPackMutation.ts": "Provides mutations for creating, updating, and deleting gift packs with toast notifications and automatic query invalidation.",
  "frontend/src/hooks/useGiftPacks.ts": "Provides React Query hooks for fetching gift packs: all packs, filtered packs by catalog filters, and individual packs by ID.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity authentication context and provider with login, logout, and identity state management using DFINITY AuthClient.",
  "frontend/src/hooks/useOrder.ts": "Provides a mutation hook for creating orders with cart items, delivery details, and payment information, invalidating order history on success.",
  "frontend/src/hooks/useOrderHistory.ts": "React Query hook that fetches the authenticated user's order history from the backend actor.",
  "frontend/src/hooks/useProductMutation.ts": "Provides mutation hooks for creating, updating, and deleting custom products with category and image management.",
  "frontend/src/hooks/useQueries.ts": "Provides a mutation hook to initialize backend data and invalidate gift pack queries on success.",
  "frontend/src/hooks/useRazorpay.ts": "Custom hook for integrating Razorpay payment gateway with order details, handling payment success/failure callbacks.",
  "frontend/src/hooks/useUserProfile.ts": "Provides query and mutation hooks for fetching and updating user profile data including delivery address and contact information.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom color palette (terracotta, sage, cream) using OKLCH color space and dark mode support.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query and Internet Identity providers wrapping the main App component.",
  "frontend/src/pages/AdminPage.tsx": "Admin dashboard page with sections for managing products, categories, coupons, and gift packs through dedicated management components.",
  "frontend/src/pages/CartPage.tsx": "Shopping cart page displaying cart items with quantity controls, custom messages, and a summary sidebar, with empty state handling.",
  "frontend/src/pages/CatalogPage.tsx": "Displays a browsable catalog of gift packs with search functionality and filter sidebar. Shows loading skeletons while fetching data and renders products in a grid layout.",
  "frontend/src/pages/CheckoutPage.tsx": "Handles the checkout flow including authentication check, address form, coupon validation, order summary, and Razorpay payment integration. Redirects users to login if not authenticated or to catalog if cart is empty.",
  "frontend/src/pages/ContactPage.tsx": "Provides a contact form with validation for name, email, phone, and message fields. Displays success/error alerts and uses react-hook-form for form management.",
  "frontend/src/pages/CustomPackPage.tsx": "Multi-step wizard for creating custom gift packs, allowing users to select basket type, size, items, packing type, and optional message card. Validates each step before proceeding and adds the custom pack to cart.",
  "frontend/src/pages/HomePage.tsx": "Landing page featuring a hero section with call-to-action buttons, feature highlights (curated collections, personalization, delivery), and a showcase of featured gift packs. Includes add-to-cart functionality for featured items.",
  "frontend/src/pages/OrderConfirmationPage.tsx": "Displays order confirmation details after successful payment, showing order ID, estimated delivery date, and payment information retrieved from session storage. Provides navigation back to home or orders page.",
  "frontend/src/pages/ProfilePage.tsx": "Profile page component that allows authenticated users to view and update their personal information, delivery address, and view order history. Includes pincode serviceability validation and form handling with react-hook-form.",
  "frontend/src/types/razorpay.d.ts": "TypeScript type definitions for Razorpay payment gateway integration, including options, response, and instance interfaces.",
  "frontend/src/utils/validation.ts": "Utility functions for validating pincode (6 digits) and phone number (10 digits) formats, with placeholder for delivery availability checking.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom color scheme (terracotta, sage, cream), typography settings, animations, and extended theme utilities for the e-commerce platform.",
  "project_state.json": "Project state tracking file documenting completed features for multi-image support in products and gift packs, including form updates, list displays, and carousel implementations."
}