{
  "backend/main.mo": "Main Motoko actor defining types (GiftPack, CartItem, Order, UserProfile, Coupon, etc.) and in-memory maps for managing gift packs, orders, carts, payments, coupons, categories, and delivery pincodes with CRUD operations and business logic.",
  "feature_evidence.json": "Feature evidence report documenting four implemented features for admin gift pack management: GiftPackForm, GiftPackList, GiftPackManagement components, and AdminPage integration with high confidence test mappings.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend components including pages (HomePage, CatalogPage, CustomPackPage, CartPage, CheckoutPage, etc.), layout components, product components, customization components, and cart components with their key functionality.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes defining colors for background, foreground, primary, secondary, muted, accent, destructive, borders, and sidebar components.",
  "frontend/index.html": "HTML entry point loading Razorpay checkout script and mounting the React application at root div with main.tsx module.",
  "frontend/src/App.tsx": "Root application component configuring TanStack Router with all routes, ThemeProvider, automatic dummy data initialization, and login/logout detection that syncs cart from backend on login and clears cart on logout.",
  "frontend/src/components/admin/CategoryForm.tsx": "React Hook Form-based category creation form with name and description fields, validation, loading states, and terracotta-styled submit button.",
  "frontend/src/components/admin/CategoryList.tsx": "Displays list of categories in card layout with loading skeletons and empty state handling, showing category name and optional description.",
  "frontend/src/components/admin/CategoryManagement.tsx": "Combines CategoryForm and CategoryList with mutation handling, toast notifications for success/error, and form reset on successful category creation.",
  "frontend/src/components/admin/CouponForm.tsx": "React form component for creating coupons with fields for code, discount percentage, min/max discount constraints, expiration date, and quantity, using react-hook-form for validation.",
  "frontend/src/components/admin/CouponList.tsx": "Displays a grid of coupon cards showing code, discount details, quantity remaining, expiration date, and status badges (Active/Expired/Sold Out) with loading skeletons.",
  "frontend/src/components/admin/CouponManagement.tsx": "Container component that combines CouponForm and CouponList, handles coupon creation via mutation hook, and displays success/error toasts.",
  "frontend/src/components/admin/GiftPackForm.tsx": "React form component for creating gift packs with fields for ID, title, description, price, discount, category, image URL, basket type, and size using react-hook-form and select dropdowns.",
  "frontend/src/components/admin/GiftPackList.tsx": "Displays a grid of gift pack cards with images, titles, descriptions, pricing with discounts, category badges, and basket/size details, with loading skeletons.",
  "frontend/src/components/admin/GiftPackManagement.tsx": "Container component that combines GiftPackForm and GiftPackList, handles gift pack creation via mutation hook with toast notifications, and resets form on success.",
  "frontend/src/components/admin/ProductForm.tsx": "React form component for creating products with fields for ID, title, description, price, discount, category, image URL, basket type, and size—nearly identical structure to GiftPackForm.",
  "frontend/src/components/admin/ProductManagement.tsx": "Admin component for creating new gift pack products using ProductForm and useProductMutation hook. Handles form submission, success/error toasts, and form reset after successful creation.",
  "frontend/src/components/cart/CartItemRow.tsx": "Displays a single cart item with image, title, category badge, custom message, wrapping option, quantity controls, and remove button. Fetches gift pack details and calculates discounted prices.",
  "frontend/src/components/cart/CartSummary.tsx": "Shows cart summary card with subtotal, GST (18%), and total amount. Includes a 'Proceed to Checkout' button that navigates to the checkout page.",
  "frontend/src/components/checkout/AddressForm.tsx": "Delivery address form that validates pincode serviceability via backend actor and phone number format. Pre-fills data from user profile and displays real-time pincode validation status.",
  "frontend/src/components/checkout/OrderSummary.tsx": "Checkout order summary card displaying items list, subtotal, coupon discount (if applied), GST, and total amount. Uses cart and gift packs data to calculate totals.",
  "frontend/src/components/customization/BasketTypeSelector.tsx": "Grid of selectable basket type cards (wicker basket, wooden crate, gift box) with icons and descriptions. Highlights selected type with ring border and terracotta styling.",
  "frontend/src/components/customization/ItemSelector.tsx": "Grid of selectable gift items with max item limit enforcement. Displays mock items with name, description, price, and selection checkmarks; shows alert with current selection count.",
  "frontend/src/components/customization/MessageCardForm.tsx": "Textarea form for adding optional personalized message to gift with 200 character limit. Shows remaining character count below the input field.",
  "frontend/src/components/customization/PackingTypeSelector.tsx": "Renders a grid of selectable packing style cards (Classic Wrap, Premium Wrap, Gold Ribbon, Silver Ribbon) with visual indicators for the selected option.",
  "frontend/src/components/customization/PackPreview.tsx": "Displays a sticky sidebar preview of the custom gift pack showing selected basket type, size, items, packing style, and message card with running price total and item removal functionality.",
  "frontend/src/components/customization/PersonalizationForm.tsx": "Empty file with no content.",
  "frontend/src/components/customization/SizeSelector.tsx": "Displays a grid of three size options (Small, Medium, Large) as selectable cards showing capacity, description, and price increment.",
  "frontend/src/components/customization/StepIndicator.tsx": "Shows a horizontal progress indicator with 5 steps (Basket Type, Size, Products, Packing, Message) displaying completion status with checkmarks and connecting lines.",
  "frontend/src/components/customization/StepNavigation.tsx": "Provides Back and Next navigation buttons for the customization flow with conditional enabling based on step validity.",
  "frontend/src/components/delivery/PincodeChecker.tsx": "A card component with input field and button to check if delivery is available for a given 6-digit pincode, showing validation and serviceability results.",
  "frontend/src/components/layout/Footer.tsx": "Site footer with four columns containing about info, quick links, delivery details, and social media icons, plus copyright and Caffeine.ai attribution.",
  "frontend/src/components/layout/Header.tsx": "Sticky header with logo, desktop/mobile navigation, pincode checker popover, cart icon with item count badge, and Internet Identity login/logout functionality.",
  "frontend/src/components/layout/Layout.tsx": "Root layout component that wraps the app with Header, main content area (Outlet), and Footer in a flex column structure.",
  "frontend/src/components/product/FilterSidebar.tsx": "A responsive filter sidebar component for gift pack catalog that allows filtering by category (birthday, anniversary, corporate, festive, custom) and price range with a slider. Renders as a card on desktop and a sheet on mobile.",
  "frontend/src/components/product/GiftPackCard.tsx": "Displays a gift pack as a card with image, title, description, category badge, price (with optional discount), and an 'Add to Cart' button. Handles adding items to cart with toast notifications.",
  "frontend/src/components/product/ProductGrid.tsx": "Renders a responsive grid of GiftPackCard components or displays an empty state message when no gift packs are found.",
  "frontend/src/components/profile/OrderHistoryCard.tsx": "Displays a single order with expandable details including order ID, date, status badges (order and payment), total amount, and item list. Formats dates and handles nanosecond timestamps.",
  "frontend/src/components/profile/OrderHistorySection.tsx": "Fetches and displays user order history sorted by date (most recent first) using OrderHistoryCard components. Shows loading skeletons, error states, and empty state when no orders exist.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor instance based on Internet Identity authentication state. Automatically invalidates and refetches dependent queries when the actor changes.",
  "frontend/src/hooks/useCart.ts": "Manages shopping cart state with localStorage persistence and backend synchronization. Provides functions to add, update, remove items, clear cart, and calculate totals with coupon discounts.",
  "frontend/src/hooks/useCategories.ts": "React Query hook that fetches all categories from the backend actor.",
  "frontend/src/hooks/useCategoryMutation.ts": "React Query mutation hook for creating new categories that invalidates the categories query cache on success.",
  "frontend/src/hooks/useContactForm.ts": "React Query mutation hook for submitting contact form data (name, email, phone, message) to the backend.",
  "frontend/src/hooks/useCoupon.ts": "Provides a mutation hook for validating coupon codes and a utility function to calculate discount amounts based on coupon percentage.",
  "frontend/src/hooks/useCouponMutation.ts": "Provides React Query hooks for creating coupons and fetching all coupons (currently returns empty array as backend method is not yet implemented).",
  "frontend/src/hooks/useGiftPacks.ts": "Exports React Query hooks for fetching all gift packs, filtered gift packs by catalog filters, and individual gift packs by ID.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for Internet Identity authentication, managing login state, identity persistence, and delegation validation.",
  "frontend/src/hooks/useOrder.ts": "Exports a React Query mutation hook for creating orders with cart items, delivery address, payment details, and optional coupon codes.",
  "frontend/src/hooks/useOrderHistory.ts": "Provides a React Query hook to fetch the authenticated user's order history from the backend actor.",
  "frontend/src/hooks/useProductMutation.ts": "Exports a React Query mutation hook for creating products with details like title, price, category, images, basket type, and size.",
  "frontend/src/hooks/useQueries.ts": "Provides a mutation hook to initialize backend data and invalidate gift pack queries on success.",
  "frontend/src/hooks/useRazorpay.ts": "Custom hook for integrating Razorpay payment gateway, handling payment initiation, success/failure callbacks, and processing state.",
  "frontend/src/hooks/useUserProfile.ts": "Provides React Query hooks for fetching and updating user profile data including name, email, phone, address, and pincode.",
  "frontend/src/index.css": "Defines Tailwind CSS configuration with custom color palette (terracotta, sage, cream) using OKLCH color space and utility classes for theming.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query client and Internet Identity provider, then renders the root App component.",
  "frontend/src/pages/AdminPage.tsx": "Admin dashboard page displaying management interfaces for categories, products, coupons, and gift packs in separate card sections.",
  "frontend/src/pages/CartPage.tsx": "Shopping cart page showing cart items with quantity controls, empty state with navigation options, and a cart summary sidebar for checkout.",
  "frontend/src/pages/CatalogPage.tsx": "Displays a browsable catalog of gift packs with search functionality, filter sidebar, and product grid. Shows loading skeletons while fetching data and uses the useFilteredGiftPacks hook to apply filters and search terms.",
  "frontend/src/pages/CheckoutPage.tsx": "Handles the checkout flow including authentication check, address form, order summary, coupon validation, and Razorpay payment integration. Manages cart items, calculates totals with discounts, creates orders, and navigates to confirmation page after successful payment.",
  "frontend/src/pages/ContactPage.tsx": "Provides a contact form with validation for name, email, phone, and message fields. Uses react-hook-form for form management and displays success/error alerts after submission via the useContactForm hook.",
  "frontend/src/pages/CustomPackPage.tsx": "Multi-step wizard for creating custom gift packs with basket type, size, item selection, packing type, and optional message card. Validates each step, enforces item limits based on size, and adds the custom pack to cart upon completion.",
  "frontend/src/pages/HomePage.tsx": "Landing page featuring a hero section with call-to-action buttons, a features section highlighting curated collections and delivery, and a showcase of featured gift packs. Uses gradient backgrounds and decorative imagery.",
  "frontend/src/pages/OrderConfirmationPage.tsx": "Displays order confirmation details after successful checkout, including order ID, estimated delivery date, and payment information retrieved from sessionStorage. Provides navigation buttons to continue shopping or view orders.",
  "frontend/src/pages/ProfilePage.tsx": "User profile page component with form for managing personal details and delivery address, including pincode serviceability checking and order history display. Uses react-hook-form for validation and integrates with Internet Identity authentication.",
  "frontend/src/types/razorpay.d.ts": "TypeScript type definitions for Razorpay payment gateway integration, including options, response, and instance interfaces.",
  "frontend/src/utils/validation.ts": "Utility functions for validating Indian pincodes (6 digits) and phone numbers (10 digits), with placeholder for delivery availability checking.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom color palette (terracotta, sage, cream), typography settings, animations, and shadcn/ui theming using OKLCH color space.",
  "project_state.json": "Project state tracking document showing completed features for gift pack management in admin dashboard and pending feature requests for custom packages and gift packs."
}