{
  "backend/main.mo": "Main backend actor defining all data types (GiftPack, Cart, Order, UserProfile, Coupon, etc.), storage maps for entities, delivery pincodes, and includes mixins for blob storage and authorization.",
  "feature_evidence.json": "Feature evidence report documenting the admin authentication hook update to validate credentials against backend instead of hardcoded frontend values.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend components, pages, and hooks describing their functionality, state management, and integration patterns.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark theme colors, including sidebar, chart, and UI component styling tokens.",
  "frontend/index.html": "HTML entry point that loads the React app and includes Razorpay checkout script for payment integration.",
  "frontend/src/App.tsx": "Root application component configuring TanStack Router with all routes, AdminAuthProvider, ThemeProvider, automatic data initialization, and login/logout detection that syncs or clears cart state.",
  "frontend/src/components/admin/CategoryForm.tsx": "Reusable form component for creating or editing categories with name and description fields, validation, loading states, and cancel functionality.",
  "frontend/src/components/admin/CategoryList.tsx": "Displays a list of categories with loading skeletons, empty state, and edit buttons for each category card.",
  "frontend/src/components/admin/CategoryManagement.tsx": "Admin category management container that combines CategoryForm and CategoryList, handling create/update mutations with toast notifications and edit state management.",
  "frontend/src/components/admin/CouponForm.tsx": "React form component for creating and editing coupons with fields for code, discount percentage, min/max discount amounts, expiration date, and quantity. Uses react-hook-form for validation and supports both create and edit modes.",
  "frontend/src/components/admin/CouponList.tsx": "Displays a grid of coupon cards showing code, discount percentage, quantity remaining, expiration date, and status badges (Active/Expired/Sold Out). Includes edit button for each coupon and handles loading/empty states.",
  "frontend/src/components/admin/CouponManagement.tsx": "Parent component that orchestrates coupon creation, editing, and listing by combining CouponForm and CouponList components. Manages state for editing mode and handles create/update mutations with toast notifications.",
  "frontend/src/components/admin/GiftPackForm.tsx": "React form component for creating and editing gift packs with fields for ID, title, description, price, discount, category, images (multi-field array), basket type, and size. Uses react-hook-form with field arrays for image URLs.",
  "frontend/src/components/admin/GiftPackList.tsx": "Displays a grid of gift pack cards with images, title, description, price, discount badge, category/basket/size badges, and edit/delete actions. Includes confirmation dialog for deletion and handles loading/error/empty states.",
  "frontend/src/components/admin/GiftPackManagement.tsx": "Parent component that orchestrates gift pack CRUD operations by combining GiftPackForm and GiftPackList components. Manages editing state and delegates create, update, and delete operations to mutation hooks.",
  "frontend/src/components/admin/ProductForm.tsx": "React form component using react-hook-form for creating/editing products with fields for ID, name, description, price, category, and multiple image URLs. Supports validation, field arrays for images, and handles both create and edit modes with initial data.",
  "frontend/src/components/admin/ProductList.tsx": "Displays a grid of product cards with images, details, and action buttons for editing/deleting. Shows loading skeletons, error states, and empty state when no products exist.",
  "frontend/src/components/admin/ProductManagement.tsx": "Main admin component that orchestrates product CRUD operations by combining ProductForm and ProductList. Manages state for showing/hiding form, editing products, and handles create/update/delete mutations with toast notifications.",
  "frontend/src/components/auth/ProtectedAdminRoute.tsx": "Route guard component that checks admin authentication status and redirects to login if not authenticated. Shows loading spinner during auth check.",
  "frontend/src/components/cart/CartItemRow.tsx": "Displays a single cart item with image, title, price (with discount), quantity controls, custom message/wrapping options, and remove button. Calculates and shows item total based on quantity.",
  "frontend/src/components/cart/CartSummary.tsx": "Shows cart totals including subtotal, GST (18%), and final total with a proceed to checkout button. Fetches gift packs data to calculate accurate pricing.",
  "frontend/src/components/checkout/AddressForm.tsx": "Form for entering delivery address with fields for name, street, city, state, pincode, and phone. Validates pincode serviceability via backend actor, pre-fills from user profile, and shows real-time pincode validation status.",
  "frontend/src/components/checkout/OrderSummary.tsx": "Displays a checkout order summary card showing cart items, subtotal, coupon discount, GST (18%), and total price with loading skeleton states.",
  "frontend/src/components/customization/BasketTypeSelector.tsx": "Renders a grid of selectable basket type cards (Wicker Basket, Wooden Crate, Gift Box) with icons, descriptions, and visual selection state.",
  "frontend/src/components/customization/ItemSelector.tsx": "Displays a grid of selectable gift items with a maximum item limit (default 12), showing selection state and disabling items when limit is reached.",
  "frontend/src/components/customization/MessageCardForm.tsx": "Provides a textarea for entering an optional gift message with a 200-character limit and remaining character counter.",
  "frontend/src/components/customization/PackingTypeSelector.tsx": "Displays a grid of selectable packing style options (Classic Wrap, Premium Wrap, Gold Ribbon, Silver Ribbon) with color-coded visual indicators.",
  "frontend/src/components/customization/PackPreview.tsx": "Shows a sticky preview card of the custom gift pack configuration including basket type, size, selected items with prices, packing style, and message card with total price calculation.",
  "frontend/src/components/customization/PersonalizationForm.tsx": "Empty component file with no content.",
  "frontend/src/components/customization/SizeSelector.tsx": "Renders selectable size cards (Small, Medium, Large) with capacity ranges, descriptions, and additional pricing information.",
  "frontend/src/components/customization/StepIndicator.tsx": "Displays a horizontal progress indicator with 5 steps (Basket Type, Size, Products, Packing, Message) showing completed, current, and upcoming states.",
  "frontend/src/components/customization/StepNavigation.tsx": "Provides Back and Next navigation buttons for multi-step forms with conditional enabling based on step validity and position.",
  "frontend/src/components/delivery/PincodeChecker.tsx": "A card component that allows users to input a 6-digit pincode and check if delivery is available to that area, displaying success or error messages based on validation and backend serviceability checks.",
  "frontend/src/components/layout/Footer.tsx": "Footer component displaying company info, quick navigation links, delivery information, social media icons, copyright notice, and a caffeine.ai attribution link.",
  "frontend/src/components/layout/Header.tsx": "Main navigation header with logo, desktop/mobile menus, pincode checker popover, cart icon with item count badge, and Internet Identity login/logout functionality with admin link for authenticated admins.",
  "frontend/src/components/layout/Layout.tsx": "Root layout component that wraps the application with Header, main content area (Outlet), and Footer in a flex column structure.",
  "frontend/src/components/product/FilterSidebar.tsx": "Filtering UI component for catalog browsing with category checkboxes and price range slider, displayed as a desktop sidebar card or mobile sheet drawer.",
  "frontend/src/components/product/GiftPackCard.tsx": "Product card component displaying gift pack details with image carousel, discount badge, title, description, pricing, and add-to-cart button.",
  "frontend/src/components/product/ProductGrid.tsx": "Grid layout component that renders a collection of GiftPackCard components or displays an empty state message when no products are found.",
  "frontend/src/components/profile/OrderHistoryCard.tsx": "Displays a single order with expandable details including order status, payment status, items, total amount, and formatted date. Uses badges for status visualization and supports collapsible item lists.",
  "frontend/src/components/profile/OrderHistorySection.tsx": "Renders the order history section with loading states, error handling, and empty state. Fetches orders via useOrderHistory hook and displays them sorted by date using OrderHistoryCard components.",
  "frontend/src/hooks/useActor.ts": "Manages the backend actor instance with authentication via Internet Identity. Automatically recreates the actor when identity changes and invalidates dependent queries.",
  "frontend/src/hooks/useAdminAuth.tsx": "Provides admin authentication context with hardcoded credentials (admin/admin), session persistence in localStorage, and login/logout functionality.",
  "frontend/src/hooks/useCart.ts": "Manages shopping cart state with localStorage persistence and backend synchronization. Handles add/remove/update operations, quantity management, and calculates totals with coupon support.",
  "frontend/src/hooks/useCategories.ts": "React Query hook that fetches all categories from the backend actor when available.",
  "frontend/src/hooks/useCategoryMutation.ts": "Provides mutations for creating and updating categories with automatic query invalidation. Update functionality is a placeholder pending backend implementation.",
  "frontend/src/hooks/useContactForm.ts": "React Query mutation hook for submitting contact form data (name, email, phone, message) to the backend actor.",
  "frontend/src/hooks/useCoupon.ts": "Provides coupon validation mutation and a utility function to calculate discount amounts based on coupon percentage and subtotal.",
  "frontend/src/hooks/useCouponMutation.ts": "Provides mutations for creating and updating coupons with query invalidation. Includes a useAllCoupons query hook that returns empty array pending backend implementation.",
  "frontend/src/hooks/useCustomProducts.ts": "React Query hook that fetches all products from the backend actor when available.",
  "frontend/src/hooks/useGiftPackMutation.ts": "Provides mutations for creating, updating, and deleting gift packs with image blob handling, query invalidation, and toast notifications for success/error states.",
  "frontend/src/hooks/useGiftPacks.ts": "Provides React Query hooks for fetching gift packs: all gift packs, filtered gift packs by catalog filters, and individual gift packs by ID.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity authentication with React context, providing login/logout functionality, identity management, and authentication status tracking using @dfinity/auth-client.",
  "frontend/src/hooks/useOrder.ts": "Provides a mutation hook for creating orders with cart items, delivery address, payment details, and optional coupon codes, invalidating order history cache on success.",
  "frontend/src/hooks/useOrderHistory.ts": "Fetches and returns the authenticated user's order history using React Query, with error handling and actor dependency checks.",
  "frontend/src/hooks/useProductMutation.ts": "Provides mutation hooks for creating, updating, and deleting custom products with category, price, and image management (delete not yet implemented in backend).",
  "frontend/src/hooks/useQueries.ts": "Provides a mutation hook to initialize backend data and invalidate the gift packs cache upon successful initialization.",
  "frontend/src/hooks/useRazorpay.ts": "Integrates Razorpay payment gateway with order details, handling payment initiation, success/failure callbacks, and processing state management.",
  "frontend/src/hooks/useUserProfile.ts": "Manages user profile data with hooks for fetching the caller's profile and updating profile information including name, email, phone, address, and pincode.",
  "frontend/src/index.css": "Defines Tailwind CSS configuration with a warm color palette (terracotta, sage green, cream) for light and dark modes, including custom utility classes and typography styles.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query client and Internet Identity provider, then renders the root App component.",
  "frontend/src/pages/AdminLoginPage.tsx": "Admin login page with form validation using react-hook-form, authenticating credentials via useAdminAuth hook and redirecting to admin dashboard on success.",
  "frontend/src/pages/AdminPage.tsx": "Admin dashboard page displaying management interfaces for products, categories, coupons, and gift packs, with logout functionality and protected access.",
  "frontend/src/pages/CartPage.tsx": "Displays shopping cart with items, quantities, and customization options; shows empty state with navigation to catalog/custom pack creation, and includes cart summary with checkout functionality.",
  "frontend/src/pages/CatalogPage.tsx": "Browse page for gift packs with search bar, filter sidebar, and product grid; displays loading skeletons while fetching filtered gift pack data.",
  "frontend/src/pages/CheckoutPage.tsx": "Handles checkout flow with authentication check, delivery address form, coupon validation/application, order summary, and Razorpay payment integration; creates order and clears cart on successful payment.",
  "frontend/src/pages/ContactPage.tsx": "Contact form page with fields for name, email, phone, and message; displays success/error alerts and validates phone numbers using custom validation.",
  "frontend/src/pages/CustomPackPage.tsx": "Multi-step wizard for creating custom gift packs: select basket type, size, items, packing type, and optional message card; validates each step and adds completed pack to cart.",
  "frontend/src/pages/HomePage.tsx": "Landing page with hero section, feature highlights (curated collections, personalization, delivery), and featured gift packs grid with add-to-cart functionality.",
  "frontend/src/pages/OrderConfirmationPage.tsx": "Displays order confirmation details including order ID, estimated delivery date, and payment status retrieved from sessionStorage after successful checkout.",
  "frontend/src/pages/ProfilePage.tsx": "User profile management page with form for updating personal information and delivery address, includes pincode serviceability validation and order history section.",
  "frontend/src/types/razorpay.d.ts": "TypeScript type definitions for Razorpay payment gateway integration including options, response, and instance interfaces.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, storing, and managing URL parameters from both regular query strings and hash-based routing, with sessionStorage persistence support.",
  "frontend/src/utils/validation.ts": "Validation utility functions for Indian pincode (6 digits) and phone number (10 digits) formats with backward compatibility aliases.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom color scheme (terracotta, sage, cream), typography settings, animations, and design system tokens for the gift pack store.",
  "project_state.json": "Project metadata tracking feature requests for admin authentication system, including pending tasks to add hardcoded admin credentials in the backend."
}