{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Add gift pack management to admin panel",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Add GiftPackManagement section to AdminPage alongside existing management sections",
      "acceptanceCriteria": [
        "The AdminPage displays a fourth card section titled 'Gift Pack Management'",
        "The GiftPackManagement component is rendered within this new section",
        "The layout maintains consistency with existing management sections"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/AdminPage.tsx",
          "operation": "modify",
          "description": "Add a fourth Card section for Gift Pack Management that imports and renders the GiftPackManagement component. Place this section alongside the existing ProductManagement, CategoryManagement, and CouponManagement cards, maintaining consistent styling with terracotta header, matching padding, and responsive grid layout."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Update useGiftPackMutation hook to use backend gift pack CRUD methods instead of placeholder product methods",
      "acceptanceCriteria": [
        "createGiftPackMutation calls actor.createGiftPack with full GiftPack data including basketType and size",
        "updateGiftPackMutation calls actor.updateGiftPack with the pack ID and updated data",
        "Both mutations invalidate the giftPacks query cache on success",
        "Mutations display appropriate toast notifications for success and error states"
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useGiftPackMutation.ts",
          "operation": "modify",
          "description": "Replace the createProductMutation placeholder with a proper createGiftPackMutation that calls actor.createGiftPack, passing all GiftPack fields including id, title, description, price, discount, category, items (empty array for now), images (empty array for now), basketType, and size. Replace the updateProductMutation placeholder with updateGiftPackMutation that calls actor.updateGiftPack with the same parameters. Both mutations should invalidate the 'giftPacks' query key on success using queryClient.invalidateQueries. Ensure toast notifications display success messages for create/update operations and error messages on failure."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Add delete functionality to GiftPackList component with confirmation dialog",
      "acceptanceCriteria": [
        "Each gift pack card displays a delete button alongside the edit button",
        "Clicking delete triggers a confirmation dialog before deleting",
        "Successful deletion removes the gift pack from the list and shows a success toast",
        "Failed deletion shows an error toast with the failure reason"
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useGiftPackMutation.ts",
          "operation": "modify",
          "description": "Add a deleteGiftPackMutation hook using useMutation that calls actor.deleteGiftPack with the gift pack ID. On success, invalidate the 'giftPacks' query cache and display a success toast notification. On error, display an error toast with the failure message."
        },
        {
          "path": "frontend/src/components/admin/GiftPackList.tsx",
          "operation": "modify",
          "description": "Import and use the deleteGiftPackMutation hook from useGiftPackMutation. Add a delete Button (with Trash2 icon from lucide-react) next to the Edit button on each gift pack card. Wire the delete button to open an AlertDialog (from shadcn/ui) that displays a confirmation message asking 'Are you sure you want to delete this gift pack?' with Cancel and Delete action buttons. When the user confirms deletion, call the deleteGiftPackMutation with the gift pack ID. The AlertDialog should use destructive styling for the delete action button."
        }
      ]
    }
  ]
}