{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Add edit functionality to admin dashboard",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Add edit button to each gift pack card that opens an edit form with pre-filled data",
      "acceptanceCriteria": [
        "Each gift pack card displays an edit button or icon",
        "Clicking edit button opens an edit form with the gift pack's current data pre-populated",
        "Form allows modification of all gift pack fields (title, description, price, discount, category, image URL, basket type, size)"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/admin/GiftPackList.tsx",
          "operation": "modify",
          "description": "Add an edit button (pencil icon) to each gift pack card. When clicked, the button should trigger an onEdit callback that passes the full gift pack data to the parent component for editing."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Create useGiftPackMutation hook with update mutation support",
      "acceptanceCriteria": [
        "Hook provides an updateGiftPack mutation function",
        "Mutation invalidates gift packs query cache on success",
        "Hook returns loading state and error handling"
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useGiftPackMutation.ts",
          "operation": "create",
          "description": "Create a new mutation hook that provides both createGiftPack and updateGiftPack mutations. The updateGiftPack mutation should call the backend updateProduct method with the gift pack ID and all updated fields. On success, invalidate the 'giftPacks' query cache to trigger a refetch. Return loading states and error handling for both mutations."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Update GiftPackManagement to handle both create and edit modes with appropriate success messages",
      "acceptanceCriteria": [
        "Component displays 'Gift Pack Created' toast on creation success",
        "Component displays 'Gift Pack Updated' toast on update success",
        "Form resets after successful creation but closes/returns to list after successful edit"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/admin/GiftPackForm.tsx",
          "operation": "modify",
          "description": "Extend the form to support both create and edit modes. Accept an optional editingGiftPack prop of type GiftPack. When provided, pre-fill all form fields with the gift pack's current values using useEffect and form.reset(). Update the form title to show 'Edit Gift Pack' vs 'Create New Gift Pack' based on mode. Add a mode prop ('create' or 'edit') to control submit behavior."
        },
        {
          "path": "frontend/src/components/admin/GiftPackManagement.tsx",
          "operation": "modify",
          "description": "Update to manage edit state by tracking the currently editing gift pack. Add an onEdit handler that receives gift pack data from GiftPackList and sets it as the editing target. Use the new useGiftPackMutation hook (replacing useProductMutation) to handle both create and update operations. Show 'Gift Pack Created' toast on successful creation and 'Gift Pack Updated' toast on successful update. Reset the form after creation, but clear the editing state (return to list view) after successful update. Pass the editing gift pack and onEdit handler to child components."
        }
      ]
    },
    {
      "id": "REQ-5",
      "summary": "Add edit functionality to category, coupon, and product sections in admin dashboard",
      "acceptanceCriteria": [
        "CategoryList displays edit buttons for each category with edit form capability",
        "CouponList displays edit buttons for each coupon with edit form capability",
        "Backend provides update functions for categories and coupons",
        "All edit operations show appropriate success/error feedback"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/admin/CategoryList.tsx",
          "operation": "modify",
          "description": "Add an edit button (pencil icon) to each category card. When clicked, trigger an onEdit callback that passes the category data (name, description) to the parent component."
        },
        {
          "path": "frontend/src/components/admin/CategoryForm.tsx",
          "operation": "modify",
          "description": "Extend the form to support both create and edit modes. Accept optional editingCategory prop and mode prop. When editing, pre-fill the name and description fields using useEffect and form.reset(). Update the form heading to show 'Edit Category' vs 'Create New Category' based on mode."
        },
        {
          "path": "frontend/src/hooks/useCategoryMutation.ts",
          "operation": "modify",
          "description": "Add an updateCategory mutation that calls a backend update method for categories (once available). For now, export both createCategory and a placeholder updateCategory mutation that invalidates the categories cache on success. Return loading and error states for both mutations."
        },
        {
          "path": "frontend/src/components/admin/CategoryManagement.tsx",
          "operation": "modify",
          "description": "Add state to track the currently editing category. Add an onEdit handler to receive category data from CategoryList. Use the updated useCategoryMutation hook to handle both create and update operations. Show 'Category Created' toast on creation success and 'Category Updated' toast on update success. Pass editing state and onEdit handler to child components. Note: Backend updateCategory capability is required but not yet implemented; the frontend will be ready once the backend method is added."
        },
        {
          "path": "frontend/src/components/admin/CouponList.tsx",
          "operation": "modify",
          "description": "Add an edit button (pencil icon) to each coupon card. When clicked, trigger an onEdit callback that passes the full coupon data to the parent component for editing."
        },
        {
          "path": "frontend/src/components/admin/CouponForm.tsx",
          "operation": "modify",
          "description": "Extend the form to support both create and edit modes. Accept optional editingCoupon prop and mode prop. When editing, pre-fill all fields (code, discountPercentage, minDiscountPercentage, maxDiscountAmount, expirationDate, totalQuantity) using useEffect and form.reset(). Convert the date field appropriately. Update the form heading to show 'Edit Coupon' vs 'Create New Coupon' based on mode."
        },
        {
          "path": "frontend/src/hooks/useCouponMutation.ts",
          "operation": "modify",
          "description": "Add an updateCoupon mutation that calls a backend update method for coupons (once available). Export both createCoupon and a placeholder updateCoupon mutation that invalidates the coupons query cache on success. Return loading and error states for both mutations. Note: Backend updateCoupon capability is required but not yet implemented."
        },
        {
          "path": "frontend/src/components/admin/CouponManagement.tsx",
          "operation": "modify",
          "description": "Add state to track the currently editing coupon. Add an onEdit handler to receive coupon data from CouponList. Use the updated useCouponMutation hook to handle both create and update operations. Show 'Coupon Created' toast on creation success and 'Coupon Updated' toast on update success. Pass editing state and onEdit handler to child components. Note: Backend updateCoupon capability is required but not yet implemented; the frontend will be ready once the backend method is added."
        }
      ]
    }
  ]
}