{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Add username and password authentication to admin dashboard",
  "requirements": [
    {
      "id": "REQ-2",
      "summary": "Create an admin login page at /admin/login with username and password input fields",
      "acceptanceCriteria": [
        "Login form displays username and password fields",
        "Form validates that both fields are filled before submission",
        "Form shows error messages for invalid credentials",
        "Successful login redirects to /admin dashboard"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/AdminLoginPage.tsx",
          "operation": "create",
          "description": "Create a new admin login page component with username and password form fields. Use react-hook-form for form validation ensuring both fields are required. Include error state display for invalid credentials returned from backend authentication. On successful authentication, store admin session state and redirect to /admin route. Style with shadcn/ui form components and Card layout matching the existing design system."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Add a new route configuration for /admin/login that renders the AdminLoginPage component. Position this route before the protected /admin route in the router configuration to ensure proper route matching precedence."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Protect the /admin route to require authentication before displaying the admin dashboard",
      "acceptanceCriteria": [
        "Unauthenticated users accessing /admin are redirected to /admin/login",
        "Authenticated admin users can access the dashboard",
        "Authentication state persists across page refreshes",
        "Admin can log out and return to login page"
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useAdminAuth.ts",
          "operation": "create",
          "description": "Create a custom hook to manage admin authentication state using React Context. Provide functions for login (calls backend authentication validation), logout (clears session), and checking authentication status. Store admin session in localStorage for persistence across page refreshes. The hook should call the backend authentication validation method when logging in and handle authentication status checks."
        },
        {
          "path": "frontend/src/components/auth/AdminAuthProvider.tsx",
          "operation": "create",
          "description": "Create a React Context provider component that wraps the admin authentication logic from useAdminAuth hook. This provider should initialize authentication state from localStorage on mount, provide context values for isAuthenticated, login, and logout functions, and be used to wrap admin-related routes."
        },
        {
          "path": "frontend/src/components/auth/ProtectedAdminRoute.tsx",
          "operation": "create",
          "description": "Create a route guard component that checks admin authentication status using the useAdminAuth hook. If the user is not authenticated, redirect to /admin/login using TanStack Router's Navigate component. If authenticated, render the children (admin dashboard). Include loading state while checking authentication to prevent flash of unauthorized content."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Wrap the AdminAuthProvider around the router configuration. Modify the /admin route to use ProtectedAdminRoute as a wrapper, ensuring all admin pages require authentication. Ensure the /admin/login route remains accessible without authentication."
        },
        {
          "path": "frontend/src/pages/AdminPage.tsx",
          "operation": "modify",
          "description": "Add a logout button to the admin dashboard header using the useAdminAuth hook. The button should call the logout function and redirect to /admin/login. Position the logout button in the top-right corner of the admin interface for easy access."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Remove or hide the admin navigation link from the Header component for non-authenticated admin users",
      "acceptanceCriteria": [
        "Admin link only appears in navigation when admin is authenticated",
        "Regular users do not see admin navigation link",
        "Admin navigation link functions correctly for authenticated admins"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/layout/Header.tsx",
          "operation": "modify",
          "description": "Import and use the useAdminAuth hook to check admin authentication status. Conditionally render the Admin navigation link only when isAdminAuthenticated returns true. Ensure the check does not interfere with regular user navigation or Internet Identity authentication flows. The admin link should be visually consistent with other navigation items when displayed."
        }
      ]
    }
  ]
}