{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Add multiple image upload support for products and gift packs",
  "requirements": [
    {
      "id": "REQ-3",
      "summary": "Update ProductForm component to support multiple image URLs with add/remove/reorder functionality",
      "acceptanceCriteria": [
        "Form displays a list of image URL inputs",
        "Users can add new image URL fields using an 'Add Image' button",
        "Users can remove individual image URLs",
        "At least one image URL is required",
        "Form validation ensures all image URL fields are filled before submission"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/admin/ProductForm.tsx",
          "operation": "modify",
          "description": "Replace the single imageUrl input field with a dynamic array of image URL inputs. Add state management for the images array using useFieldArray from react-hook-form. Implement 'Add Image' button to append new image URL fields. Add remove buttons for each image URL field (disabled when only one image remains). Update form validation to ensure at least one image URL is present and all fields are filled. Update the form submission to pass the images array to the create/update product mutations."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Update GiftPackForm component to support multiple image URLs with add/remove/reorder functionality",
      "acceptanceCriteria": [
        "Form displays a list of image URL inputs",
        "Users can add new image URL fields using an 'Add Image' button",
        "Users can remove individual image URLs",
        "At least one image URL is required",
        "Form validation ensures all image URL fields are filled before submission"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/admin/GiftPackForm.tsx",
          "operation": "modify",
          "description": "Replace the single imageUrl input field with a dynamic array of ExternalBlob image inputs. Add state management for the images array using useFieldArray from react-hook-form. Implement 'Add Image' button to append new image URL fields. Add remove buttons for each image URL field (disabled when only one image remains). Update form validation to ensure at least one image URL is present and all fields are filled. Convert image URL strings to ExternalBlob instances using ExternalBlob.fromURL() when submitting. Update the form submission to pass the images array to the create/update gift pack mutations. Verify the blob-storage component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-5",
      "summary": "Update ProductList component to display the first image from the images array as product thumbnail",
      "acceptanceCriteria": [
        "Product cards display the first image from the images array",
        "Fallback placeholder is shown if images array is empty"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/admin/ProductList.tsx",
          "operation": "modify",
          "description": "Update the product card image rendering to use product.images[0] instead of product.imageUrl. Add conditional logic to display a placeholder image or icon when the images array is empty or undefined. Ensure the image element maintains the same styling and aspect ratio as the current implementation."
        }
      ]
    },
    {
      "id": "REQ-6",
      "summary": "Update GiftPackList component to display the first image from the images array as gift pack thumbnail",
      "acceptanceCriteria": [
        "Gift pack cards display the first image from the images array",
        "Fallback placeholder is shown if images array is empty"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/admin/GiftPackList.tsx",
          "operation": "modify",
          "description": "Update the gift pack card image rendering to use giftPack.images[0]?.getDirectURL() instead of giftPack.imageUrl. Add conditional logic to display a placeholder image or icon when the images array is empty or undefined. Ensure the ExternalBlob's getDirectURL() method is used for proper image display. Verify the blob-storage component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-7",
      "summary": "Update GiftPackCard component to display an image carousel for multiple images with navigation controls",
      "acceptanceCriteria": [
        "Gift pack cards show an image carousel when multiple images exist",
        "Users can navigate between images using previous/next controls",
        "Single image gift packs display without carousel controls",
        "Carousel indicators show current image position"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/product/GiftPackCard.tsx",
          "operation": "modify",
          "description": "Add state management for tracking the current image index in the carousel. Replace the single image display with a carousel container that shows giftPack.images[currentIndex]?.getDirectURL(). Implement previous/next navigation buttons that increment/decrement the current index with wraparound logic. Add dot indicators at the bottom of the image area showing the total number of images and highlighting the current image. Conditionally render carousel controls only when giftPack.images.length > 1. Add keyboard navigation support for left/right arrow keys. Ensure the ExternalBlob's getDirectURL() method is used for all image URLs. Verify the blob-storage component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-8",
      "summary": "Update CartItemRow component to display the first image from the images array for cart items",
      "acceptanceCriteria": [
        "Cart items display the first image from the images array",
        "Fallback placeholder is shown if images array is empty"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/cart/CartItemRow.tsx",
          "operation": "modify",
          "description": "Update the cart item image rendering to use pack.images[0]?.getDirectURL() instead of pack.imageUrl. Add conditional logic to display a placeholder image or icon when the images array is empty or undefined. Ensure the ExternalBlob's getDirectURL() method is used for proper image display with streaming and caching. Verify the blob-storage component's usage instructions before implementing."
        }
      ]
    }
  ]
}